branches/FFF/Documentation/Source/schema.org
#+TITLE: Schema for database 'zambiademo'
#+EMAIL: NELA.Percy@gmail.com
#+AUTHOR: Percy
#+DATE: March 2012
#+DESCRIPTION: Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting in the way of entering and keeping track of Presenters for the Zambia FFF-branch instance for your conference.  This is still a work in progress.
#+KEYWORDS: Zambia, Documentation, FFF branch
#+LANGUAGE: en

#+OPTIONS: \n:t ^:nil timestamp:nil creator:nil H:3 num:t @:t ::nil |:t -:t todo:nil tasks:nil tags:t <:t *:t author:t email:t skip:nil d:t f:t pri:t
#+LATEX_CLASS: koma-article
#+LaTeX_CLASS_OPTIONS: [tablesignature] 
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage[scaled]{beraserif}
#+LATEX_HEADER: \usepackage[scaled]{berasans}
#+LATEX_HEADER: \usepackage[scaled]{beramono}
#+LATEX_HEADER: \usepackage[usenames,dvipsnames]{color}
#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \usepackage{subfig}
#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \lstnewenvironment{common-lispcode}
#+LaTeX_HEADER: {\lstset{language={HTML},basicstyle={\ttfamily\footnotesize},frame=single,breaklines=true}}
#+LaTeX_HEADER: {}
#+LATEX_HEADER: \usepackage{paralist}
#+LATEX_HEADER: \let\itemize\compactitem
#+LATEX_HEADER: \let\description\compactdesc
#+LATEX_HEADER: \let\enumerate\compactenum
#+LATEX_HEADER: \usepackage[letterpaper,includeheadfoot,top=12.5mm,bottom=25mm,left=19mm,right=19mm]{geometry}
#+LATEX_HEADER: \pagestyle{fancy}
#+LaTeX: \pagenumbering{roman}
#+LaTeX: \thispagestyle{fancy}
#+LaTeX: \renewcommand{\headrulewidth}{0pt}
#+LaTeX: \renewcommand{\footrulewidth}{1pt}
#+LaTeX: \lhead{}
#+LaTeX: \rhead{}
#+LaTeX: \chead{}
#+LaTeX: \lfoot{{{{{AUTHOR}}}} <{{{{EMAIL}}}}>}
#+LaTeX: \cfoot{}
#+LaTeX: \rfoot{\thepage}
#+LaTeX: \begin{abstract}
#+LaTeX: \vspace{5cm}
#+LaTeX: {\LARGE{\textbf{Abstract:\\}}}
{{{DESCRIPTION}}}
#+LaTeX: \end{abstract}
#+HTML:<h2>Abstract:<br></h2><p>{{{DESCRIPTION}}}</p>
#+LaTeX: \newpage
#+LaTeX: \renewcommand{\headrulewidth}{1pt}
#+LaTeX: \chead{{{{{TITLE}}}}}
#+LaTeX: \tableofcontents
#+LaTeX: %\listoftables
#+LaTeX: %\listoffigures
#+LaTeX: \newpage
#+LaTeX: \pagenumbering{arabic}
* CongoDump

#+CAPTION: CongoDump Fields
#+LABEL: tbl:congodumpfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|-------------+--------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| Field       | Type         | Collation         | Null   | Key    | Default | Extra  | Privileges                      | Comment |
|-------------+--------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| badgeid     | varchar(15)  | latin1_swedish_ci | &nbsp; | PRI    | &nbsp;  | &nbsp; | select,insert,update,references | &nbsp;  |
| firstname   | varchar(30)  | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| lastname    | varchar(40)  | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| badgename   | varchar(51)  | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| phone       | varchar(100) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| email       | varchar(100) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| postaddress | varchar(100) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| regtype     | varchar(40)  | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
|-------------+--------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|

#+CAPTION: CongoDump Indexes
#+LABEL: tbl:congodumpindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table     | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| CongoDump |          0 | PRIMARY  |            1 | badgeid     | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

