branches/FFF/Documentation/schema.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Schema for database 'zambiademo'</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="March 2012"/>
<meta name="author" content="Percy"/>
<meta name="description" content="Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting in the way of entering and keeping track of Presenters for the Zambia FFF-branch instance for your conference.  This is still a work in progress."/>
<meta name="keywords" content="Zambia, Documentation, FFF branch"/>
<link rel="stylesheet" href="../webpages/Common.css" type="text/css"/>

</head>
<body>
<div id="content">

<h1 class="title">Schema for database 'zambiademo'</h1>

<p>Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting in the way of entering and keeping track of Presenters for the Zambia FFF-branch instance for your conference.  This is still a work in progress.<br/>
<h2>Abstract:<br></h2><p>Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting in the way of entering and keeping track of Presenters for the Zambia FFF-branch instance for your conference.  This is still a work in progress.</p>
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 CongoDump </a></li>
<li><a href="#sec-2">2 Divisions </a></li>
<li><a href="#sec-3">3 Features </a></li>
<li><a href="#sec-4">4 KidsCategories </a></li>
<li><a href="#sec-5">5 ParticipantAvailability </a></li>
<li><a href="#sec-6">6 ParticipantAvailabilityTimes </a></li>
<li><a href="#sec-7">7 ParticipantHasRole </a></li>
<li><a href="#sec-8">8 ParticipantInterests </a></li>
<li><a href="#sec-9">9 ParticipantOnSession </a></li>
<li><a href="#sec-10">10 Participants </a></li>
<li><a href="#sec-11">11 ParticipantSessionInterest </a></li>
<li><a href="#sec-12">12 ParticipantSuggestions </a></li>
<li><a href="#sec-13">13 PermissionAtoms </a></li>
<li><a href="#sec-14">14 PermissionRoles </a></li>
<li><a href="#sec-15">15 Permissions </a></li>
<li><a href="#sec-16">16 Phases </a></li>
<li><a href="#sec-17">17 PubCharacteristics </a></li>
<li><a href="#sec-18">18 PubStatuses </a></li>
<li><a href="#sec-19">19 RegTypes </a></li>
<li><a href="#sec-20">20 Roles </a></li>
<li><a href="#sec-21">21 RoomHasSet </a></li>
<li><a href="#sec-22">22 Rooms </a></li>
<li><a href="#sec-23">23 RoomSets </a></li>
<li><a href="#sec-24">24 Schedule </a></li>
<li><a href="#sec-25">25 Services </a></li>
<li><a href="#sec-26">26 SessionHasFeature </a></li>
<li><a href="#sec-27">27 SessionHasPubChar </a></li>
<li><a href="#sec-28">28 SessionHasService </a></li>
<li><a href="#sec-29">29 Sessions </a></li>
<li><a href="#sec-30">30 SessionStatuses </a></li>
<li><a href="#sec-31">31 Times </a></li>
<li><a href="#sec-32">32 Tracks </a></li>
<li><a href="#sec-33">33 Types </a></li>
<li><a href="#sec-34">34 UserHasPermissionRole </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> CongoDump </h2>
<div class="outline-text-2" id="text-1">


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:congodumpfields" id="tbl:congodumpfields"></a>
<caption>CongoDump Fields</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Field</th><th scope="col">Type</th><th scope="col">Collation</th><th scope="col">Null</th><th scope="col">Key</th><th scope="col">Default</th><th scope="col">Extra</th><th scope="col">Privileges</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>badgeid</td><td>varchar(15)</td><td>latin1_swedish_ci</td><td></td><td>PRI</td><td></td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>firstname</td><td>varchar(30)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>lastname</td><td>varchar(40)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>badgename</td><td>varchar(51)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>phone</td><td>varchar(100)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>email</td><td>varchar(100)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>postaddress</td><td>varchar(100)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>regtype</td><td>varchar(40)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:congodumpindexes" id="tbl:congodumpindexes"></a>
<caption>CongoDump Indexes</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Table</th><th scope="col">Non unique</th><th scope="col">Key name</th><th scope="col">Seq in index</th><th scope="col">Column name</th><th scope="col">Collation</th><th scope="col">Cardinality</th><th scope="col">Sub part</th><th scope="col">Packed</th><th scope="col">Null</th><th scope="col">Index type</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>CongoDump</td><td>0</td><td>PRIMARY</td><td>1</td><td>badgeid</td><td>A</td><td>2</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p></div>

</div>
