branches/FFF/Documentation/PDF/schema.tex
\documentclass[tablesignature]{scrartcl}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{booktabs}
\usepackage[scaled]{beraserif}
\usepackage[scaled]{berasans}
\usepackage[scaled]{beramono}
\usepackage[usenames,dvipsnames]{color}
\usepackage{fancyhdr}
\usepackage{subfig}
\usepackage{listings}
\lstnewenvironment{common-lispcode}
{\lstset{language={HTML},basicstyle={\ttfamily\footnotesize},frame=single,breaklines=true}}
{}
\usepackage{paralist}
\let\itemize\compactitem
\let\description\compactdesc
\let\enumerate\compactenum
\usepackage[letterpaper,includeheadfoot,top=12.5mm,bottom=25mm,left=19mm,right=19mm]{geometry}
\pagestyle{fancy}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Schema for database `zambiademo'}
\author{Percy}
\date{March 2012}

\begin{document}

\maketitle

% Org-mode is exporting headings to 3 levels.

\pagenumbering{roman}
\thispagestyle{fancy}
\renewcommand{\headrulewidth}{0pt}
\renewcommand{\footrulewidth}{1pt}
\lhead{}
\rhead{}
\chead{}
\lfoot{{Percy} <{NELA.Percy@gmail.com}>}
\cfoot{}
\rfoot{\thepage}
\begin{abstract}
\vspace{5cm}
{\LARGE{\textbf{Abstract:\\}}}
Zambia is a piece of Conference Management Software.  This document is a ``How To'' guide assisting in the way of entering and keeping track of Presenters for the Zambia FFF-branch instance for your conference.  This is still a work in progress.
\end{abstract}
\newpage
\renewcommand{\headrulewidth}{1pt}
\chead{{Schema for database 'zambiademo'}}
\tableofcontents
%\listoftables
%\listoffigures
\newpage
\pagenumbering{arabic}
\section{CongoDump}
\label{sec-1}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{CongoDump Fields} \label{tbl:congodumpfields}\\
\hline
 Field        &  Type          &  Collation                &  Null     &  Key      &  Default  &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 badgeid      &  varchar(15)   &  latin1\_{}swedish\_{}ci  &  \&nbsp;  &  PRI      &  \&nbsp;  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 firstname    &  varchar(30)   &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 lastname     &  varchar(40)   &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 badgename    &  varchar(51)   &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 phone        &  varchar(100)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 email        &  varchar(100)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 postaddress  &  varchar(100)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 regtype      &  varchar(40)   &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{CongoDump Indexes} \label{tbl:congodumpindexes}\\
\hline
 Table      &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 CongoDump  &           0  &  PRIMARY   &             1  &  badgeid      &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}
