branches/FFF/Documentation/Source/schema.org
* Divisions

#+CAPTION: Divisions Fields
#+LABEL: tbl:divisionsfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field         | Type        | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| divisionid    | int(11)     | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| divisionname  | varchar(30) | latin1_general_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| display_order | int(11)     | NULL              | &nbsp; | &nbsp; | 0       | &nbsp;         | select,insert,update,references | &nbsp;  |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: Divisions Indexes
#+LABEL: tbl:Divisionsindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+-------------|
| Table     | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment     |
|-----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+-------------|
| Divisions |          0 | PRIMARY  |            1 | divisionid  | A         |           5 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;      |
|-----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+-------------|

* Features

#+CAPTION: Features Fields
#+LABEL: tbl:featuresfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field         | Type        | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| featureid     | int(11)     | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| featurename   | varchar(50) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| display_order | int(11)     | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: Features Indexes
#+LABEL: tbl:featuresindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table    | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Features |          0 | PRIMARY  |            1 | featureid   | A         |          12 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp   |
|----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

