branches/FFF/Documentation/PDF/schema.tex
\section{Divisions}
\label{sec-2}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{Divisions Fields} \label{tbl:divisionsfields}\\
\hline
 Field             &  Type         &  Collation                &  Null     &  Key      &  Default  &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 divisionid        &  int(11)      &  NULL                     &  \&nbsp;  &  PRI      &  (NULL)   &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 divisionname      &  varchar(30)  &  latin1\_{}general\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 display\_{}order  &  int(11)      &  NULL                     &  \&nbsp;  &  \&nbsp;  &  0        &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{Divisions Indexes} \label{tbl:Divisionsindexes}\\
\hline
 Table      &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Divisions  &           0  &  PRIMARY   &             1  &  divisionid   &  A          &            5  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}
\section{Features}
\label{sec-3}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{Features Fields} \label{tbl:featuresfields}\\
\hline
 Field             &  Type         &  Collation                &  Null     &  Key      &  Default  &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 featureid         &  int(11)      &  NULL                     &  \&nbsp;  &  PRI      &  (NULL)   &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 featurename       &  varchar(50)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 display\_{}order  &  int(11)      &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{Features Indexes} \label{tbl:featuresindexes}\\
\hline
 Table     &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Features  &           0  &  PRIMARY   &             1  &  featureid    &  A          &           12  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp   \\
\hline
\end{longtable}
