branches/FFF/Documentation/Source/schema.org
* KidsCategories

#+CAPTION: KidsCategories Fields
#+LABEL: tbl:kidscategoriesfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field         | Type        | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| kidscatid     | int(11)     | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| kidscatname   | varchar(50) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| display_order | int(11)     | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: KidsCategories Indexes
#+LABEL: tbl:kidscategoriesindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|----------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table          | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|----------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| KidsCategories |          0 | PRIMARY  |            1 | kidscatid   | A         |           4 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|----------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

