branches/FFF/Documentation/PDF/schema.tex
\section{KidsCategories}
\label{sec-4}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{KidsCategories Fields} \label{tbl:kidscategoriesfields}\\
\hline
 Field             &  Type         &  Collation                &  Null     &  Key      &  Default  &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 kidscatid         &  int(11)      &  NULL                     &  \&nbsp;  &  PRI      &  (NULL)   &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 kidscatname       &  varchar(50)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 display\_{}order  &  int(11)      &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{KidsCategories Indexes} \label{tbl:kidscategoriesindexes}\\
\hline
 Table           &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 KidsCategories  &           0  &  PRIMARY   &             1  &  kidscatid    &  A          &            4  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}
