branches/FFF/Documentation/Source/schema.org
* ParticipantAvailability

#+CAPTION: ParticipantAvailability Fields
#+LABEL: tbl:participantavailabilityfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|------------------+--------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| Field            | Type         | Collation         | Null   | Key    | Default | Extra  | Privileges                      | Comment |
|------------------+--------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| badgeid          | varchar(15)  | latin1_swedish_ci | &nbsp; | PRI    | &nbsp;  | &nbsp; | select,insert,update,references | &nbsp;  |
| fridaymaxprog    | int(11)      | NULL              | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| saturdaymaxprog  | int(11)      | NULL              | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| sundaymaxprog    | int(11)      | NULL              | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| maxprog          | int(11)      | NULL              | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| preventconflict  | varchar(255) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| otherconstraints | varchar(255) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| numkidsfasttrack | int(11)      | NULL              | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
|------------------+--------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|

#+CAPTION: ParticipantAvailability Indexes
#+LABEL: tbl:participantavailabilityindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-------------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table                   | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-------------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| ParticipantAvailability |          0 | PRIMARY  |            1 | badgeid     | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-------------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: ParticipantAvailabilty Foreign Key Relationships
#+LABEL: tbl:participantavailabilityfkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|--------------------------------+-----------------+---------------+---------------+------------|
| FK Id                          | Reference Table | Source Column | Target Column | Extra Info |
|--------------------------------+-----------------+---------------+---------------+------------|
| ParticipantAvailability_ibfk_1 | Participants    | `badgeid`     | `badgeid`     |            |
|--------------------------------+-----------------+---------------+---------------+------------|

