branches/FFF/Documentation/Source/schema.org
* ParticipantAvailabilityTimes

#+CAPTION: ParticipantAvailabilityTimes Fields
#+LABEL: tbl:participantavailabilitytimesfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|-----------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| Field           | Type        | Collation         | Null   | Key    | Default | Extra  | Privileges                      | Comment |
|-----------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| badgeid         | varchar(15) | latin1_swedish_ci | &nbsp; | PRI    | &nbsp;  | &nbsp; | select,insert,update,references | &nbsp;  |
| availabilitynum | int(11)     | NULL              | &nbsp; | PRI    | 0       | &nbsp; | select,insert,update,references | &nbsp;  |
| starttime       | time        | NULL              | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| endtime         | time        | NULL              | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
|-----------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|

#+CAPTION: ParticipantAvailabilityTimes Indexes
#+LABEL: tbl:participantavailabilitytimesindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|------------------------------+------------+----------+--------------+-----------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table                        | Non unique | Key name | Seq in index | Column name     | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|------------------------------+------------+----------+--------------+-----------------+-----------+-------------+----------+--------+--------+------------+---------|
| ParticipantAvailabilityTimes |          0 | PRIMARY  |            1 | badgeid         | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| ParticipantAvailabilityTimes |          0 | PRIMARY  |            2 | availabilitynum | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|------------------------------+------------+----------+--------------+-----------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: ParticipantAvailabilityTimes Foreign Key Relationships
#+LABEL: tbl:participantavailabilitytimesfkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|-------------------------------------+-----------------+---------------+---------------+------------|
| FK Id                               | Reference Table | Source Column | Target Column | Extra Info |
|-------------------------------------+-----------------+---------------+---------------+------------|
| ParticipantAvailabilityTimes_ibfk_1 | Participants    | `badgeid`     | `badgeid`     |            |
|-------------------------------------+-----------------+---------------+---------------+------------|

