branches/FFF/Documentation/schema.html

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> ParticipantAvailabilityTimes </h2>
<div class="outline-text-2" id="text-6">


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:participantavailabilitytimesfields" id="tbl:participantavailabilitytimesfields"></a>
<caption>ParticipantAvailabilityTimes Fields</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Field</th><th scope="col">Type</th><th scope="col">Collation</th><th scope="col">Null</th><th scope="col">Key</th><th scope="col">Default</th><th scope="col">Extra</th><th scope="col">Privileges</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>badgeid</td><td>varchar(15)</td><td>latin1_swedish_ci</td><td></td><td>PRI</td><td></td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>availabilitynum</td><td>int(11)</td><td>NULL</td><td></td><td>PRI</td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>starttime</td><td>time</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>endtime</td><td>time</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:participantavailabilitytimesindexes" id="tbl:participantavailabilitytimesindexes"></a>
<caption>ParticipantAvailabilityTimes Indexes</caption>
<colgroup><col align="left" /><col align="right" /><col align="left" /><col align="right" /><col align="left" /><col align="left" /><col align="right" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Table</th><th scope="col">Non unique</th><th scope="col">Key name</th><th scope="col">Seq in index</th><th scope="col">Column name</th><th scope="col">Collation</th><th scope="col">Cardinality</th><th scope="col">Sub part</th><th scope="col">Packed</th><th scope="col">Null</th><th scope="col">Index type</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>ParticipantAvailabilityTimes</td><td>0</td><td>PRIMARY</td><td>1</td><td>badgeid</td><td>A</td><td>2</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
<tr><td>ParticipantAvailabilityTimes</td><td>0</td><td>PRIMARY</td><td>2</td><td>availabilitynum</td><td>A</td><td>2</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:participantavailabilitytimesfkr" id="tbl:participantavailabilitytimesfkr"></a>
<caption>ParticipantAvailabilityTimes Foreign Key Relationships</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">FK Id</th><th scope="col">Reference Table</th><th scope="col">Source Column</th><th scope="col">Target Column</th><th scope="col">Extra Info</th></tr>
</thead>
<tbody>
<tr><td>ParticipantAvailabilityTimes_ibfk_1</td><td>Participants</td><td>`badgeid`</td><td>`badgeid`</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p></div>

</div>
