branches/FFF/Documentation/PDF/schema.tex
\section{ParticipantAvailabilityTimes}
\label{sec-6}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{ParticipantAvailabilityTimes Fields} \label{tbl:participantavailabilitytimesfields}\\
\hline
 Field            &  Type         &  Collation                &  Null     &  Key      &  Default  &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 badgeid          &  varchar(15)  &  latin1\_{}swedish\_{}ci  &  \&nbsp;  &  PRI      &  \&nbsp;  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 availabilitynum  &  int(11)      &  NULL                     &  \&nbsp;  &  PRI      &  0        &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 starttime        &  time         &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 endtime          &  time         &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{ParticipantAvailabilityTimes Indexes} \label{tbl:participantavailabilitytimesindexes}\\
\hline
 Table                         &  Non unique  &  Key name  &  Seq in index  &  Column name      &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 ParticipantAvailabilityTimes  &           0  &  PRIMARY   &             1  &  badgeid          &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 ParticipantAvailabilityTimes  &           0  &  PRIMARY   &             2  &  availabilitynum  &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{ParticipantAvailabilityTimes Foreign Key Relationships} \label{tbl:participantavailabilitytimesfkr}\\
\hline
 FK Id                                      &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 ParticipantAvailabilityTimes\_{}ibfk\_{}1  &  Participants     &  `badgeid`      &  `badgeid`      &              \\
\hline
\end{longtable}
