branches/FFF/Documentation/Source/schema.org
* ParticipantHasRole

#+CAPTION: ParticipantHasRole Fields
#+LABEL: tbl:participanthasrolefields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------+-------------+-------------------+--------+-----+---------+--------+---------------------------------+---------|
| Field   | Type        | Collation         | Null   | Key | Default | Extra  | Privileges                      | Comment |
|---------+-------------+-------------------+--------+-----+---------+--------+---------------------------------+---------|
| badgeid | varchar(15) | latin1_swedish_ci | &nbsp; | PRI | &nbsp;  | &nbsp; | select,insert,update,references | &nbsp;  |
| roleid  | int(11)     | NULL              | &nbsp; | PRI | 0       | &nbsp; | select,insert,update,references | &nbsp;  |
|---------+-------------+-------------------+--------+-----+---------+--------+---------------------------------+---------|

#+CAPTION: ParticipantHasRole Indexes
#+LABEL: tbl:participanthasroleindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|--------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table              | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|--------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| ParticipantHasRole |          0 | PRIMARY  |            1 | badgeid     | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| ParticipantHasRole |          0 | PRIMARY  |            2 | roleid      | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| ParticipantHasRole |          1 | roleid   |            1 | roleid      | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|--------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: ParticipantHasRole Foreign Key Relationships
#+LABEL: tbl:participanthasrolefkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|---------------------------+-----------------+---------------+---------------+------------|
| FK Id                     | Reference Table | Source Column | Target Column | Extra Info |
|---------------------------+-----------------+---------------+---------------+------------|
| ParticipantHasRole_ibfk_1 | Participants    | `badgeid`     | `badgeid`     |            |
| ParticipantHasRole_ibfk_2 | Roles           | `roleid`      | `roleid`      |            |
|---------------------------+-----------------+---------------+---------------+------------|

