branches/FFF/Documentation/PDF/schema.tex
\section{ParticipantHasRole}
\label{sec-7}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{ParticipantHasRole Fields} \label{tbl:participanthasrolefields}\\
\hline
 Field    &  Type         &  Collation                &  Null     &  Key  &  Default  &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 badgeid  &  varchar(15)  &  latin1\_{}swedish\_{}ci  &  \&nbsp;  &  PRI  &  \&nbsp;  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 roleid   &  int(11)      &  NULL                     &  \&nbsp;  &  PRI  &  0        &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{ParticipantHasRole Indexes} \label{tbl:participanthasroleindexes}\\
\hline
 Table               &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 ParticipantHasRole  &           0  &  PRIMARY   &             1  &  badgeid      &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 ParticipantHasRole  &           0  &  PRIMARY   &             2  &  roleid       &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 ParticipantHasRole  &           1  &  roleid    &             1  &  roleid       &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{ParticipantHasRole Foreign Key Relationships} \label{tbl:participanthasrolefkr}\\
\hline
 FK Id                            &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 ParticipantHasRole\_{}ibfk\_{}1  &  Participants     &  `badgeid`      &  `badgeid`      &              \\
 ParticipantHasRole\_{}ibfk\_{}2  &  Roles            &  `roleid`       &  `roleid`       &              \\
\hline
\end{longtable}
