branches/FFF/Documentation/Source/schema.org
* ParticipantInterests

#+CAPTION: ParticipantInterests Fields
#+LABEL: tbl:participantinterestsfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| Field      | Type        | Collation         | Null   | Key    | Default | Extra  | Privileges                      | Comment |
|------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| badgeid    | varchar(15) | latin1_swedish_ci | &nbsp; | PRI    | &nbsp;  | &nbsp; | select,insert,update,references | &nbsp;  |
| yespanels  | text        | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| nopanels   | text        | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| yespeople  | text        | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| nopeople   | text        | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| otherroles | text        | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
|------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|

#+CAPTION: ParticipantInterests Indexes
#+LABEL: tbl:participantinterestesindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|----------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table                | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|----------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| ParticipantInterests |          0 | PRIMARY  |            1 | badgeid     | A         |           1 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|----------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: ParticipantInterests Foreign Key Relationships
#+LABEL: tbl:participantinterestsfkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|-----------------------------+-----------------+---------------+---------------+------------|
| FK Id                       | Reference Table | Source Column | Target Column | Extra Info |
|-----------------------------+-----------------+---------------+---------------+------------|
| ParticipantInterests_ibfk_1 | Participants    | `badgeid`     | `badgeid`     |            |
|-----------------------------+-----------------+---------------+---------------+------------|

