branches/FFF/Documentation/PDF/schema.tex
\section{ParticipantInterests}
\label{sec-8}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{ParticipantInterests Fields} \label{tbl:participantinterestsfields}\\
\hline
 Field       &  Type         &  Collation                &  Null     &  Key      &  Default  &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 badgeid     &  varchar(15)  &  latin1\_{}swedish\_{}ci  &  \&nbsp;  &  PRI      &  \&nbsp;  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 yespanels   &  text         &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 nopanels    &  text         &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 yespeople   &  text         &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 nopeople    &  text         &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 otherroles  &  text         &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{ParticipantInterests Indexes} \label{tbl:participantinterestesindexes}\\
\hline
 Table                 &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 ParticipantInterests  &           0  &  PRIMARY   &             1  &  badgeid      &  A          &            1  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{ParticipantInterests Foreign Key Relationships} \label{tbl:participantinterestsfkr}\\
\hline
 FK Id                              &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 ParticipantInterests\_{}ibfk\_{}1  &  Participants     &  `badgeid`      &  `badgeid`      &              \\
\hline
\end{longtable}
