branches/FFF/Documentation/Source/schema.org
* ParticipantOnSession

#+CAPTION: ParticipantOnSession Fields
#+LABEL: tbl:participantonsessionfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|-----------+-------------+-------------------+--------+--------+-------------------+--------+---------------------------------+---------|
| Field     | Type        | Collation         | Null   | Key    | Default           | Extra  | Privileges                      | Comment |
|-----------+-------------+-------------------+--------+--------+-------------------+--------+---------------------------------+---------|
| badgeid   | varchar(15) | latin1_swedish_ci | &nbsp; | PRI    | &nbsp;            | &nbsp; | select,insert,update,references | &nbsp;  |
| sessionid | int(11)     | NULL              | &nbsp; | PRI    | 0                 | &nbsp; | select,insert,update,references | &nbsp;  |
| moderator | tinyint(4)  | NULL              | YES    | &nbsp; | 0                 | &nbsp; | select,insert,update,references | &nbsp;  |
| ts        | timestamp   | NULL              | YES    | &nbsp; | CURRENT_TIMESTAMP | &nbsp; | select,insert,update,references | &nbsp;  |
|-----------+-------------+-------------------+--------+--------+-------------------+--------+---------------------------------+---------|

#+CAPTION: ParticipantOnSession Indexes
#+LABEL: tbl:participantonsessionindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|----------------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table                | Non unique | Key name  | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|----------------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| ParticipantOnSession |          0 | PRIMARY   |            1 | badgeid     | A         |           1 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| ParticipantOnSession |          0 | PRIMARY   |            2 | sessionid   | A         |           1 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| ParticipantOnSession |          1 | sessionid |            1 | sessionid   | A         |           1 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|----------------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: ParticipantOnSession Foreign Key Relationships
#+LABEL: tbl:participantonsessionfkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|-----------------------------+-----------------+---------------+---------------+------------|
| FK Id                       | Reference Table | Source Column | Target Column | Extra Info |
|-----------------------------+-----------------+---------------+---------------+------------|
| ParticipantOnSession_ibfk_1 | Participants    | `badgeid`     | `badgeid`     |            |
| ParticipantOnSession_ibfk_2 | Sessions        | `sessionid`   | `sessionid`   |            |
|-----------------------------+-----------------+---------------+---------------+------------|

