branches/FFF/Documentation/PDF/schema.tex
\section{ParticipantOnSession}
\label{sec-9}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{ParticipantOnSession Fields} \label{tbl:participantonsessionfields}\\
\hline
 Field      &  Type         &  Collation                &  Null     &  Key      &  Default               &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 badgeid    &  varchar(15)  &  latin1\_{}swedish\_{}ci  &  \&nbsp;  &  PRI      &  \&nbsp;               &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 sessionid  &  int(11)      &  NULL                     &  \&nbsp;  &  PRI      &  0                     &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 moderator  &  tinyint(4)   &  NULL                     &  YES      &  \&nbsp;  &  0                     &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 ts         &  timestamp    &  NULL                     &  YES      &  \&nbsp;  &  CURRENT\_{}TIMESTAMP  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{ParticipantOnSession Indexes} \label{tbl:participantonsessionindexes}\\
\hline
 Table                 &  Non unique  &  Key name   &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 ParticipantOnSession  &           0  &  PRIMARY    &             1  &  badgeid      &  A          &            1  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 ParticipantOnSession  &           0  &  PRIMARY    &             2  &  sessionid    &  A          &            1  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 ParticipantOnSession  &           1  &  sessionid  &             1  &  sessionid    &  A          &            1  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{ParticipantOnSession Foreign Key Relationships} \label{tbl:participantonsessionfkr}\\
\hline
 FK Id                              &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 ParticipantOnSession\_{}ibfk\_{}1  &  Participants     &  `badgeid`      &  `badgeid`      &              \\
 ParticipantOnSession\_{}ibfk\_{}2  &  Sessions         &  `sessionid`    &  `sessionid`    &              \\
\hline
\end{longtable}
