branches/FFF/Documentation/Source/schema.org
* Participants

#+CAPTION: Participants Fields
#+LABEL: tbl:participantsfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| Field      | Type        | Collation         | Null   | Key    | Default | Extra  | Privileges                      | Comment |
|------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| badgeid    | varchar(15) | latin1_swedish_ci | &nbsp; | PRI    | &nbsp;  | &nbsp; | select,insert,update,references | &nbsp;  |
| password   | varchar(32) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| bestway    | varchar(12) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| interested | tinyint(1)  | NULL              | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| bio        | text        | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| pubsname   | varchar(50) | latin1_general_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
|------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|

#+CAPTION: Participants Indexes
#+LABEL: tbl:participantsindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|--------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table        | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|--------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Participants |          0 | PRIMARY  |            1 | badgeid     | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|--------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

