branches/FFF/Documentation/schema.html

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Participants </h2>
<div class="outline-text-2" id="text-10">


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:participantsfields" id="tbl:participantsfields"></a>
<caption>Participants Fields</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Field</th><th scope="col">Type</th><th scope="col">Collation</th><th scope="col">Null</th><th scope="col">Key</th><th scope="col">Default</th><th scope="col">Extra</th><th scope="col">Privileges</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>badgeid</td><td>varchar(15)</td><td>latin1_swedish_ci</td><td></td><td>PRI</td><td></td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>password</td><td>varchar(32)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>bestway</td><td>varchar(12)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>interested</td><td>tinyint(1)</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>bio</td><td>text</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>pubsname</td><td>varchar(50)</td><td>latin1_general_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:participantsindexes" id="tbl:participantsindexes"></a>
<caption>Participants Indexes</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Table</th><th scope="col">Non unique</th><th scope="col">Key name</th><th scope="col">Seq in index</th><th scope="col">Column name</th><th scope="col">Collation</th><th scope="col">Cardinality</th><th scope="col">Sub part</th><th scope="col">Packed</th><th scope="col">Null</th><th scope="col">Index type</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>Participants</td><td>0</td><td>PRIMARY</td><td>1</td><td>badgeid</td><td>A</td><td>2</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p></div>

</div>
