branches/FFF/Documentation/Source/schema.org
* ParticipantSessionInterest

#+CAPTION: ParticipantSessionInterest Fields
#+LABEL: tbl:participantsessioninterestfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|--------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| Field        | Type        | Collation         | Null   | Key    | Default | Extra  | Privileges                      | Comment |
|--------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| badgeid      | varchar(15) | latin1_swedish_ci | &nbsp; | PRI    | &nbsp;  | &nbsp; | select,insert,update,references | &nbsp;  |
| sessionid    | int(11)     | NULL              | &nbsp; | PRI    | 0       | &nbsp; | select,insert,update,references | &nbsp;  |
| rank         | int(11)     | NULL              | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| willmoderate | tinyint(1)  | NULL              | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| comments     | text        | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
|--------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|

#+CAPTION: ParticipantSessionInterest Indexes
#+LABEL: tbl:participantsessioninterestindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|----------------------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table                      | Non unique | Key name  | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|----------------------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| ParticipantSessionInterest |          0 | PRIMARY   |            1 | badgeid     | A         |           1 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| ParticipantSessionInterest |          0 | PRIMARY   |            2 | sessionid   | A         |           1 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| ParticipantSessionInterest |          1 | sessionid |            1 | sessionid   | A         |           1 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|----------------------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: ParticipantSessionInterests Foreign Key Relationships
#+LABEL: tbl:participantsessioninterestsfkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|-----------------------------------+-----------------+---------------+---------------+------------|
| FK Id                             | Reference Table | Source Column | Target Column | Extra Info |
|-----------------------------------+-----------------+---------------+---------------+------------|
| ParticipantSessionInterest_ibfk_1 | Participants    | `badgeid`     | `badgeid`     |            |
| ParticipantSessionInterest_ibfk_2 | Sessions        | `sessionid`   | `sessionid`   |            |
| ParticipantSessionInterest_ibfk_3 | Participants    | `badgeid`     | `badgeid`     |            |
| ParticipantSessionInterest_ibfk_4 | Sessions        | `sessionid`   | `sessionid`   |            |
|-----------------------------------+-----------------+---------------+---------------+------------|

