branches/FFF/Documentation/PDF/schema.tex
\section{ParticipantSessionInterest}
\label{sec-11}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{ParticipantSessionInterest Fields} \label{tbl:participantsessioninterestfields}\\
\hline
 Field         &  Type         &  Collation                &  Null     &  Key      &  Default  &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 badgeid       &  varchar(15)  &  latin1\_{}swedish\_{}ci  &  \&nbsp;  &  PRI      &  \&nbsp;  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 sessionid     &  int(11)      &  NULL                     &  \&nbsp;  &  PRI      &  0        &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 rank          &  int(11)      &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 willmoderate  &  tinyint(1)   &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 comments      &  text         &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{ParticipantSessionInterest Indexes} \label{tbl:participantsessioninterestindexes}\\
\hline
 Table                       &  Non unique  &  Key name   &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 ParticipantSessionInterest  &           0  &  PRIMARY    &             1  &  badgeid      &  A          &            1  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 ParticipantSessionInterest  &           0  &  PRIMARY    &             2  &  sessionid    &  A          &            1  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 ParticipantSessionInterest  &           1  &  sessionid  &             1  &  sessionid    &  A          &            1  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{ParticipantSessionInterests Foreign Key Relationships} \label{tbl:participantsessioninterestsfkr}\\
\hline
 FK Id                                    &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 ParticipantSessionInterest\_{}ibfk\_{}1  &  Participants     &  `badgeid`      &  `badgeid`      &              \\
 ParticipantSessionInterest\_{}ibfk\_{}2  &  Sessions         &  `sessionid`    &  `sessionid`    &              \\
 ParticipantSessionInterest\_{}ibfk\_{}3  &  Participants     &  `badgeid`      &  `badgeid`      &              \\
 ParticipantSessionInterest\_{}ibfk\_{}4  &  Sessions         &  `sessionid`    &  `sessionid`    &              \\
\hline
\end{longtable}
