branches/FFF/Documentation/Source/schema.org
* ParticipantSuggestions

#+CAPTION: ParticipantSuggestions Fields
#+LABEL: tbl:participantsuggestionsfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|-----------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| Field           | Type        | Collation         | Null   | Key    | Default | Extra  | Privileges                      | Comment |
|-----------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| badgeid         | varchar(15) | latin1_swedish_ci | &nbsp; | PRI    | &nbsp;  | &nbsp; | select,insert,update,references | &nbsp;  |
| paneltopics     | text        | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| otherideas      | text        | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| suggestedguests | text        | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
|-----------------+-------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|

#+CAPTION: ParticipantSuggestions Indexes
#+LABEL: tbl:participantsuggestionsindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|------------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table                  | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|------------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| ParticipantSuggestions |          0 | PRIMARY  |            1 | badgeid     | A         |           1 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|------------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: ParticipantSuggestions Foreign Key Relationships
#+LABEL: tbl:participantsuggestionsfkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|-------------------------------+-----------------+---------------+---------------+------------|
| FK Id                         | Reference Table | Source Column | Target Column | Extra Info |
|-------------------------------+-----------------+---------------+---------------+------------|
| ParticipantSuggestions_ibfk_1 | Participants    | `badgeid`     | `badgeid`     |            |
|-------------------------------+-----------------+---------------+---------------+------------|

* PermissionAtoms

#+CAPTION: PermissionAtoms Fields
#+LABEL: tbl:permissionatomsfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|-------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field       | Type        | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|-------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| permatomid  | int(11)     | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| permatomtag | varchar(20) | latin1_swedish_ci | &nbsp; | UNI    | &nbsp;  | &nbsp;         | select,insert,update,references | &nbsp;  |
| page        | varchar(20) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| notes       | text        | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
|-------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: PermissionAtoms Indexes
#+LABEL: tbl:permissionatomsindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-----------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table           | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-----------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| PermissionAtoms |          0 | PRIMARY  |            1 | permatomid  | A         |           4 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| PermissionAtoms |          0 | taginx   |            1 | permatomtag | A         |           4 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-----------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

