branches/FFF/Documentation/schema.html

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> ParticipantSuggestions </h2>
<div class="outline-text-2" id="text-12">


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:participantsuggestionsfields" id="tbl:participantsuggestionsfields"></a>
<caption>ParticipantSuggestions Fields</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Field</th><th scope="col">Type</th><th scope="col">Collation</th><th scope="col">Null</th><th scope="col">Key</th><th scope="col">Default</th><th scope="col">Extra</th><th scope="col">Privileges</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>badgeid</td><td>varchar(15)</td><td>latin1_swedish_ci</td><td></td><td>PRI</td><td></td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>paneltopics</td><td>text</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>otherideas</td><td>text</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>suggestedguests</td><td>text</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:participantsuggestionsindexes" id="tbl:participantsuggestionsindexes"></a>
<caption>ParticipantSuggestions Indexes</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Table</th><th scope="col">Non unique</th><th scope="col">Key name</th><th scope="col">Seq in index</th><th scope="col">Column name</th><th scope="col">Collation</th><th scope="col">Cardinality</th><th scope="col">Sub part</th><th scope="col">Packed</th><th scope="col">Null</th><th scope="col">Index type</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>ParticipantSuggestions</td><td>0</td><td>PRIMARY</td><td>1</td><td>badgeid</td><td>A</td><td>1</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:participantsuggestionsfkr" id="tbl:participantsuggestionsfkr"></a>
<caption>ParticipantSuggestions Foreign Key Relationships</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">FK Id</th><th scope="col">Reference Table</th><th scope="col">Source Column</th><th scope="col">Target Column</th><th scope="col">Extra Info</th></tr>
</thead>
<tbody>
<tr><td>ParticipantSuggestions_ibfk_1</td><td>Participants</td><td>`badgeid`</td><td>`badgeid`</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p></div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> PermissionAtoms </h2>
<div class="outline-text-2" id="text-13">


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:permissionatomsfields" id="tbl:permissionatomsfields"></a>
<caption>PermissionAtoms Fields</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Field</th><th scope="col">Type</th><th scope="col">Collation</th><th scope="col">Null</th><th scope="col">Key</th><th scope="col">Default</th><th scope="col">Extra</th><th scope="col">Privileges</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>permatomid</td><td>int(11)</td><td>NULL</td><td></td><td>PRI</td><td>(NULL)</td><td>auto_increment</td><td>select,insert,update,references</td><td></td></tr>
<tr><td>permatomtag</td><td>varchar(20)</td><td>latin1_swedish_ci</td><td></td><td>UNI</td><td></td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>page</td><td>varchar(20)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>notes</td><td>text</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:permissionatomsindexes" id="tbl:permissionatomsindexes"></a>
<caption>PermissionAtoms Indexes</caption>
<colgroup><col align="left" /><col align="right" /><col align="left" /><col align="right" /><col align="left" /><col align="left" /><col align="right" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Table</th><th scope="col">Non unique</th><th scope="col">Key name</th><th scope="col">Seq in index</th><th scope="col">Column name</th><th scope="col">Collation</th><th scope="col">Cardinality</th><th scope="col">Sub part</th><th scope="col">Packed</th><th scope="col">Null</th><th scope="col">Index type</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>PermissionAtoms</td><td>0</td><td>PRIMARY</td><td>1</td><td>permatomid</td><td>A</td><td>4</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
<tr><td>PermissionAtoms</td><td>0</td><td>taginx</td><td>1</td><td>permatomtag</td><td>A</td><td>4</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p></div>

</div>
