branches/FFF/Documentation/PDF/schema.tex
\section{ParticipantSuggestions}
\label{sec-12}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{ParticipantSuggestions Fields} \label{tbl:participantsuggestionsfields}\\
\hline
 Field            &  Type         &  Collation                &  Null     &  Key      &  Default  &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 badgeid          &  varchar(15)  &  latin1\_{}swedish\_{}ci  &  \&nbsp;  &  PRI      &  \&nbsp;  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 paneltopics      &  text         &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 otherideas       &  text         &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 suggestedguests  &  text         &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{ParticipantSuggestions Indexes} \label{tbl:participantsuggestionsindexes}\\
\hline
 Table                   &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 ParticipantSuggestions  &           0  &  PRIMARY   &             1  &  badgeid      &  A          &            1  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{ParticipantSuggestions Foreign Key Relationships} \label{tbl:participantsuggestionsfkr}\\
\hline
 FK Id                                &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 ParticipantSuggestions\_{}ibfk\_{}1  &  Participants     &  `badgeid`      &  `badgeid`      &              \\
\hline
\end{longtable}
\section{PermissionAtoms}
\label{sec-13}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{PermissionAtoms Fields} \label{tbl:permissionatomsfields}\\
\hline
 Field        &  Type         &  Collation                &  Null     &  Key      &  Default  &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 permatomid   &  int(11)      &  NULL                     &  \&nbsp;  &  PRI      &  (NULL)   &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 permatomtag  &  varchar(20)  &  latin1\_{}swedish\_{}ci  &  \&nbsp;  &  UNI      &  \&nbsp;  &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 page         &  varchar(20)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 notes        &  text         &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{PermissionAtoms Indexes} \label{tbl:permissionatomsindexes}\\
\hline
 Table            &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 PermissionAtoms  &           0  &  PRIMARY   &             1  &  permatomid   &  A          &            4  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 PermissionAtoms  &           0  &  taginx    &             1  &  permatomtag  &  A          &            4  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}
