branches/FFF/Documentation/Source/schema.org
* PermissionRoles

#+CAPTION: PermissionRoles Fields
#+LABEL: tbl:permissionrolesfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|--------------+--------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field        | Type         | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|--------------+--------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| permroleid   | int(11)      | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| permrolename | varchar(100) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| notes        | text         | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
|--------------+--------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: PermissionRoles Indexes
#+LABEL: tbl:permissionrolesindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-----------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table           | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-----------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| PermissionRoles |          0 | PRIMARY  |            1 | permroleid  | A         |           3 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-----------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

