branches/FFF/Documentation/PDF/schema.tex
\section{PermissionRoles}
\label{sec-14}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{PermissionRoles Fields} \label{tbl:permissionrolesfields}\\
\hline
 Field         &  Type          &  Collation                &  Null     &  Key      &  Default  &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 permroleid    &  int(11)       &  NULL                     &  \&nbsp;  &  PRI      &  (NULL)   &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 permrolename  &  varchar(100)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 notes         &  text          &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{PermissionRoles Indexes} \label{tbl:permissionrolesindexes}\\
\hline
 Table            &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 PermissionRoles  &           0  &  PRIMARY   &             1  &  permroleid   &  A          &            3  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}
