branches/FFF/Documentation/Source/schema.org
* Permissions

#+CAPTION: Permissions Fields
#+LABEL: tbl:permissionsfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|--------------+---------+-----------+--------+--------+---------+----------------+---------------------------------+-------------------------------|
| Field        | Type    | Collation | Null   | Key    | Default | Extra          | Privileges                      | Comment                       |
|--------------+---------+-----------+--------+--------+---------+----------------+---------------------------------+-------------------------------|
| permissionid | int(11) | NULL      | &nbsp; | PRI    |  (NULL) | auto_increment | select,insert,update,references | &nbsp;                        |
| permatomid   | int(11) | NULL      | &nbsp; | MUL    |       0 | &nbsp;         | select,insert,update,references | &nbsp;                        |
| phaseid      | int(11) | NULL      | YES    | MUL    |       0 | &nbsp;         | select,insert,update,references | null indicates all phases     |
| permroleid   | int(11) | NULL      | YES    | MUL    |       0 | &nbsp;         | select,insert,update,references | null indicates not applicable |
| badgeid      | int(11) | NULL      | YES    | &nbsp; |       0 | &nbsp;         | select,insert,update,references | null indicates not applicable |
|--------------+---------+-----------+--------+--------+---------+----------------+---------------------------------+-------------------------------|

#+CAPTION: Permissions Indexes
#+LABEL: tbl:permissionsindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-------------+------------+----------------+--------------+--------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table       | Non unique | Key name       | Seq in index | Column name  | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-------------+------------+----------------+--------------+--------------+-----------+-------------+----------+--------+--------+------------+---------|
| Permissions |          0 | PRIMARY        |            1 | permissionid | A         |           4 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| Permissions |          0 | unique1        |            1 | permatomid   | A         |           4 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| Permissions |          0 | unique1        |            2 | phaseid      | A         |           4 | (NULL)   | (NULL) | YES    | BTREE      | &nbsp;  |
| Permissions |          0 | unique1        |            3 | permroleid   | A         |           4 | (NULL)   | (NULL) | YES    | BTREE      | &nbsp;  |
| Permissions |          0 | unique1        |            4 | badgeid      | A         |           4 | (NULL)   | (NULL) | YES    | BTREE      | &nbsp;  |
| Permissions |          1 | FK_Permissions |            1 | phaseid      | A         |           4 | (NULL)   | (NULL) | YES    | BTREE      | &nbsp;  |
| Permissions |          1 | FK_PRoles      |            1 | permroleid   | A         |           4 | (NULL)   | (NULL) | YES    | BTREE      | &nbsp;  |
|-------------+------------+----------------+--------------+--------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: Permissions Foreign Key Relationships
#+LABEL: tbl:permissionsfkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|--------------------+-----------------+---------------+---------------+------------|
| FK Id              | Reference Table | Source Column | Target Column | Extra Info |
|--------------------+-----------------+---------------+---------------+------------|
| Permissions_ibfk_1 | PermissionAtoms | `permatomid`  | `permatomid`  |            |
| Permissions_ibfk_2 | Phases          | `phaseid`     | `phaseid`     |            |
| Permissions_ibfk_3 | PermissionRoles | `permroleid`  | `permroleid`  |            |
|--------------------+-----------------+---------------+---------------+------------|

