branches/FFF/Documentation/schema.html

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Permissions </h2>
<div class="outline-text-2" id="text-15">


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:permissionsfields" id="tbl:permissionsfields"></a>
<caption>Permissions Fields</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="right" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Field</th><th scope="col">Type</th><th scope="col">Collation</th><th scope="col">Null</th><th scope="col">Key</th><th scope="col">Default</th><th scope="col">Extra</th><th scope="col">Privileges</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>permissionid</td><td>int(11)</td><td>NULL</td><td></td><td>PRI</td><td>(NULL)</td><td>auto_increment</td><td>select,insert,update,references</td><td></td></tr>
<tr><td>permatomid</td><td>int(11)</td><td>NULL</td><td></td><td>MUL</td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>phaseid</td><td>int(11)</td><td>NULL</td><td>YES</td><td>MUL</td><td>0</td><td></td><td>select,insert,update,references</td><td>null indicates all phases</td></tr>
<tr><td>permroleid</td><td>int(11)</td><td>NULL</td><td>YES</td><td>MUL</td><td>0</td><td></td><td>select,insert,update,references</td><td>null indicates not applicable</td></tr>
<tr><td>badgeid</td><td>int(11)</td><td>NULL</td><td>YES</td><td></td><td>0</td><td></td><td>select,insert,update,references</td><td>null indicates not applicable</td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:permissionsindexes" id="tbl:permissionsindexes"></a>
<caption>Permissions Indexes</caption>
<colgroup><col align="left" /><col align="right" /><col align="left" /><col align="right" /><col align="left" /><col align="left" /><col align="right" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Table</th><th scope="col">Non unique</th><th scope="col">Key name</th><th scope="col">Seq in index</th><th scope="col">Column name</th><th scope="col">Collation</th><th scope="col">Cardinality</th><th scope="col">Sub part</th><th scope="col">Packed</th><th scope="col">Null</th><th scope="col">Index type</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>Permissions</td><td>0</td><td>PRIMARY</td><td>1</td><td>permissionid</td><td>A</td><td>4</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
<tr><td>Permissions</td><td>0</td><td>unique1</td><td>1</td><td>permatomid</td><td>A</td><td>4</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
<tr><td>Permissions</td><td>0</td><td>unique1</td><td>2</td><td>phaseid</td><td>A</td><td>4</td><td>(NULL)</td><td>(NULL)</td><td>YES</td><td>BTREE</td><td></td></tr>
<tr><td>Permissions</td><td>0</td><td>unique1</td><td>3</td><td>permroleid</td><td>A</td><td>4</td><td>(NULL)</td><td>(NULL)</td><td>YES</td><td>BTREE</td><td></td></tr>
<tr><td>Permissions</td><td>0</td><td>unique1</td><td>4</td><td>badgeid</td><td>A</td><td>4</td><td>(NULL)</td><td>(NULL)</td><td>YES</td><td>BTREE</td><td></td></tr>
<tr><td>Permissions</td><td>1</td><td>FK_Permissions</td><td>1</td><td>phaseid</td><td>A</td><td>4</td><td>(NULL)</td><td>(NULL)</td><td>YES</td><td>BTREE</td><td></td></tr>
<tr><td>Permissions</td><td>1</td><td>FK_PRoles</td><td>1</td><td>permroleid</td><td>A</td><td>4</td><td>(NULL)</td><td>(NULL)</td><td>YES</td><td>BTREE</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:permissionsfkr" id="tbl:permissionsfkr"></a>
<caption>Permissions Foreign Key Relationships</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">FK Id</th><th scope="col">Reference Table</th><th scope="col">Source Column</th><th scope="col">Target Column</th><th scope="col">Extra Info</th></tr>
</thead>
<tbody>
<tr><td>Permissions_ibfk_1</td><td>PermissionAtoms</td><td>`permatomid`</td><td>`permatomid`</td><td></td></tr>
<tr><td>Permissions_ibfk_2</td><td>Phases</td><td>`phaseid`</td><td>`phaseid`</td><td></td></tr>
<tr><td>Permissions_ibfk_3</td><td>PermissionRoles</td><td>`permroleid`</td><td>`permroleid`</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p></div>

</div>
