branches/FFF/Documentation/PDF/schema.tex
\section{Permissions}
\label{sec-15}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{Permissions Fields} \label{tbl:permissionsfields}\\
\hline
 Field         &  Type     &  Collation  &  Null     &  Key      &  Default  &  Extra              &  Privileges                       &  Comment                       \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 permissionid  &  int(11)  &  NULL       &  \&nbsp;  &  PRI      &   (NULL)  &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;                        \\
 permatomid    &  int(11)  &  NULL       &  \&nbsp;  &  MUL      &        0  &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;                        \\
 phaseid       &  int(11)  &  NULL       &  YES      &  MUL      &        0  &  \&nbsp;            &  select,insert,update,references  &  null indicates all phases      \\
 permroleid    &  int(11)  &  NULL       &  YES      &  MUL      &        0  &  \&nbsp;            &  select,insert,update,references  &  null indicates not applicable  \\
 badgeid       &  int(11)  &  NULL       &  YES      &  \&nbsp;  &        0  &  \&nbsp;            &  select,insert,update,references  &  null indicates not applicable  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{Permissions Indexes} \label{tbl:permissionsindexes}\\
\hline
 Table        &  Non unique  &  Key name           &  Seq in index  &  Column name   &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Permissions  &           0  &  PRIMARY            &             1  &  permissionid  &  A          &            4  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 Permissions  &           0  &  unique1            &             1  &  permatomid    &  A          &            4  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 Permissions  &           0  &  unique1            &             2  &  phaseid       &  A          &            4  &  (NULL)    &  (NULL)  &  YES      &  BTREE       &  \&nbsp;  \\
 Permissions  &           0  &  unique1            &             3  &  permroleid    &  A          &            4  &  (NULL)    &  (NULL)  &  YES      &  BTREE       &  \&nbsp;  \\
 Permissions  &           0  &  unique1            &             4  &  badgeid       &  A          &            4  &  (NULL)    &  (NULL)  &  YES      &  BTREE       &  \&nbsp;  \\
 Permissions  &           1  &  FK\_{}Permissions  &             1  &  phaseid       &  A          &            4  &  (NULL)    &  (NULL)  &  YES      &  BTREE       &  \&nbsp;  \\
 Permissions  &           1  &  FK\_{}PRoles       &             1  &  permroleid    &  A          &            4  &  (NULL)    &  (NULL)  &  YES      &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{Permissions Foreign Key Relationships} \label{tbl:permissionsfkr}\\
\hline
 FK Id                     &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Permissions\_{}ibfk\_{}1  &  PermissionAtoms  &  `permatomid`   &  `permatomid`   &              \\
 Permissions\_{}ibfk\_{}2  &  Phases           &  `phaseid`      &  `phaseid`      &              \\
 Permissions\_{}ibfk\_{}3  &  PermissionRoles  &  `permroleid`   &  `permroleid`   &              \\
\hline
\end{longtable}
