branches/FFF/Documentation/Source/schema.org
* Phases

#+CAPTION: Phases Fields
#+LABEL: tbl:phasesfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|-----------+--------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field     | Type         | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|-----------+--------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| phaseid   | int(11)      | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| phasename | varchar(100) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| current   | tinyint(1)   | NULL              | YES    | &nbsp; | 0       | &nbsp;         | select,insert,update,references | &nbsp;  |
| notes     | text         | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
|-----------+--------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: Phases Indexes
#+LABEL: tbl:phasesindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|--------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table  | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|--------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Phases |          0 | PRIMARY  |            1 | phaseid     | A         |           4 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|--------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

* PubCharacteristics

#+CAPTION: PubCharacteristics Fields
#+LABEL: tbl:pubcharacteristicsfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field         | Type        | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| pubcharid     | int(11)     | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| pubcharname   | varchar(30) | latin1_general_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| pubchartag    | varchar(10) | latin1_general_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| display_order | int(11)     | NULL              | &nbsp; | &nbsp; | 0       | &nbsp;         | select,insert,update,references | &nbsp;  |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: PubCharacteristics Indexes
#+LABEL: tbl:pubcharacteristicsindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|--------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table              | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|--------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| PubCharacteristics |          0 | PRIMARY  |            1 | pubcharid   | A         |           4 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|--------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

