branches/FFF/Documentation/schema.html

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Phases </h2>
<div class="outline-text-2" id="text-16">


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:phasesfields" id="tbl:phasesfields"></a>
<caption>Phases Fields</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Field</th><th scope="col">Type</th><th scope="col">Collation</th><th scope="col">Null</th><th scope="col">Key</th><th scope="col">Default</th><th scope="col">Extra</th><th scope="col">Privileges</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>phaseid</td><td>int(11)</td><td>NULL</td><td></td><td>PRI</td><td>(NULL)</td><td>auto_increment</td><td>select,insert,update,references</td><td></td></tr>
<tr><td>phasename</td><td>varchar(100)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>current</td><td>tinyint(1)</td><td>NULL</td><td>YES</td><td></td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>notes</td><td>text</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:phasesindexes" id="tbl:phasesindexes"></a>
<caption>Phases Indexes</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Table</th><th scope="col">Non unique</th><th scope="col">Key name</th><th scope="col">Seq in index</th><th scope="col">Column name</th><th scope="col">Collation</th><th scope="col">Cardinality</th><th scope="col">Sub part</th><th scope="col">Packed</th><th scope="col">Null</th><th scope="col">Index type</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>Phases</td><td>0</td><td>PRIMARY</td><td>1</td><td>phaseid</td><td>A</td><td>4</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p></div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> PubCharacteristics </h2>
<div class="outline-text-2" id="text-17">


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:pubcharacteristicsfields" id="tbl:pubcharacteristicsfields"></a>
<caption>PubCharacteristics Fields</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Field</th><th scope="col">Type</th><th scope="col">Collation</th><th scope="col">Null</th><th scope="col">Key</th><th scope="col">Default</th><th scope="col">Extra</th><th scope="col">Privileges</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>pubcharid</td><td>int(11)</td><td>NULL</td><td></td><td>PRI</td><td>(NULL)</td><td>auto_increment</td><td>select,insert,update,references</td><td></td></tr>
<tr><td>pubcharname</td><td>varchar(30)</td><td>latin1_general_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>pubchartag</td><td>varchar(10)</td><td>latin1_general_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>display_order</td><td>int(11)</td><td>NULL</td><td></td><td></td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:pubcharacteristicsindexes" id="tbl:pubcharacteristicsindexes"></a>
<caption>PubCharacteristics Indexes</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Table</th><th scope="col">Non unique</th><th scope="col">Key name</th><th scope="col">Seq in index</th><th scope="col">Column name</th><th scope="col">Collation</th><th scope="col">Cardinality</th><th scope="col">Sub part</th><th scope="col">Packed</th><th scope="col">Null</th><th scope="col">Index type</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>PubCharacteristics</td><td>0</td><td>PRIMARY</td><td>1</td><td>pubcharid</td><td>A</td><td>4</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p></div>

</div>
