branches/FFF/Documentation/PDF/schema.tex
\section{Phases}
\label{sec-16}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{Phases Fields} \label{tbl:phasesfields}\\
\hline
 Field      &  Type          &  Collation                &  Null     &  Key      &  Default  &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 phaseid    &  int(11)       &  NULL                     &  \&nbsp;  &  PRI      &  (NULL)   &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 phasename  &  varchar(100)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 current    &  tinyint(1)    &  NULL                     &  YES      &  \&nbsp;  &  0        &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 notes      &  text          &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{Phases Indexes} \label{tbl:phasesindexes}\\
\hline
 Table   &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Phases  &           0  &  PRIMARY   &             1  &  phaseid      &  A          &            4  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}
\section{PubCharacteristics}
\label{sec-17}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{PubCharacteristics Fields} \label{tbl:pubcharacteristicsfields}\\
\hline
 Field             &  Type         &  Collation                &  Null     &  Key      &  Default  &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 pubcharid         &  int(11)      &  NULL                     &  \&nbsp;  &  PRI      &  (NULL)   &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 pubcharname       &  varchar(30)  &  latin1\_{}general\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 pubchartag        &  varchar(10)  &  latin1\_{}general\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 display\_{}order  &  int(11)      &  NULL                     &  \&nbsp;  &  \&nbsp;  &  0        &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{PubCharacteristics Indexes} \label{tbl:pubcharacteristicsindexes}\\
\hline
 Table               &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 PubCharacteristics  &           0  &  PRIMARY   &             1  &  pubcharid    &  A          &            4  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}
