branches/FFF/Documentation/Source/schema.org
* PubStatuses

#+CAPTION: PubStatuses Fields
#+LABEL: tbl:pubsttausesfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field         | Type        | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| pubstatusid   | int(11)     | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| pubstatusname | varchar(12) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| display_order | int(11)     | NULL              | &nbsp; | &nbsp; | 0       | &nbsp;         | select,insert,update,references | &nbsp;  |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: PubStatuses Indexes
#+LABEL: tbl:pubstatusesindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table       | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| PubStatuses |          0 | PRIMARY  |            1 | pubstatusid | A         |           3 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

* RegTypes

#+CAPTION: RegTypes Fields
#+LABEL: tbl:regtypesfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------+--------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| Field   | Type         | Collation         | Null   | Key    | Default | Extra  | Privileges                      | Comment |
|---------+--------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| regtype | varchar(40)  | latin1_swedish_ci | &nbsp; | PRI    | &nbsp;  | &nbsp; | select,insert,update,references | &nbsp;  |
| message | varchar(100) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
|---------+--------------+-------------------+--------+--------+---------+--------+---------------------------------+---------|

#+CAPTION: RegTypes Indexes
#+LABEL: tbl:regtypesindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table    | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| RegTypes |          0 | PRIMARY  |            1 | regtype     | A         |           9 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

* Roles

#+CAPTION: Roles Fields
#+LABEL: tbl:rolesfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field         | Type        | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| roleid        | int(11)     | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| rolename      | varchar(50) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| display_order | int(11)     | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: Roles Indexes
#+LABEL: tbl:rolesindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Roles |          0 | PRIMARY  |            1 | roleid      | A         |          12 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

