branches/FFF/Documentation/Source/schema.org
* RoomHasSet

#+CAPTION: RoomHasSet Fields
#+LABEL: tbl:roomhassetfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|-----------+---------+-----------+--------+--------+---------+--------+---------------------------------+---------|
| Field     | Type    | Collation | Null   | Key    | Default | Extra  | Privileges                      | Comment |
|-----------+---------+-----------+--------+--------+---------+--------+---------------------------------+---------|
| roomid    | int(11) | NULL      | &nbsp; | PRI    |       0 | &nbsp; | select,insert,update,references | &nbsp;  |
| roomsetid | int(11) | NULL      | &nbsp; | PRI    |       0 | &nbsp; | select,insert,update,references | &nbsp;  |
| capacity  | int(11) | NULL      | YES    | &nbsp; |  (NULL) | &nbsp; | select,insert,update,references | &nbsp;  |
|-----------+---------+-----------+--------+--------+---------+--------+---------------------------------+---------|

#+CAPTION: RoomHasSet Indexes
#+LABEL: tbl:roomhassetindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table      | Non unique | Key name  | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| RoomHasSet |          0 | PRIMARY   |            1 | roomid      | A         |          84 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| RoomHasSet |          0 | PRIMARY   |            2 | roomsetid   | A         |          84 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| RoomHasSet |          1 | roomsetid |            1 | roomsetid   | A         |           8 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: RoomHasSet Foreign Key Relationships
#+LABEL: tbl:roomhassetfkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|-------------------+-----------------+---------------+---------------+------------|
| FK Id             | Reference Table | Source Column | Target Column | Extra Info |
|-------------------+-----------------+---------------+---------------+------------|
| RoomHasSet_ibfk_1 | Rooms           | `roomid`      | `roomid`      |            |
| RoomHasSet_ibfk_2 | RoomSets        | `roomsetid`   | `roomsetid`   |            |
|-------------------+-----------------+---------------+---------------+------------|

