branches/FFF/Documentation/PDF/schema.tex
\section{RoomHasSet}
\label{sec-21}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{RoomHasSet Fields} \label{tbl:roomhassetfields}\\
\hline
 Field      &  Type     &  Collation  &  Null     &  Key      &  Default  &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 roomid     &  int(11)  &  NULL       &  \&nbsp;  &  PRI      &        0  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 roomsetid  &  int(11)  &  NULL       &  \&nbsp;  &  PRI      &        0  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 capacity   &  int(11)  &  NULL       &  YES      &  \&nbsp;  &   (NULL)  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{RoomHasSet Indexes} \label{tbl:roomhassetindexes}\\
\hline
 Table       &  Non unique  &  Key name   &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 RoomHasSet  &           0  &  PRIMARY    &             1  &  roomid       &  A          &           84  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 RoomHasSet  &           0  &  PRIMARY    &             2  &  roomsetid    &  A          &           84  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 RoomHasSet  &           1  &  roomsetid  &             1  &  roomsetid    &  A          &            8  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{RoomHasSet Foreign Key Relationships} \label{tbl:roomhassetfkr}\\
\hline
 FK Id                    &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 RoomHasSet\_{}ibfk\_{}1  &  Rooms            &  `roomid`       &  `roomid`       &              \\
 RoomHasSet\_{}ibfk\_{}2  &  RoomSets         &  `roomsetid`    &  `roomsetid`    &              \\
\hline
\end{longtable}
