branches/FFF/Documentation/Source/schema.org
* Rooms

#+CAPTION: Rooms Fields
#+LABEL: tbl:roomsfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+--------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field         | Type         | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|---------------+--------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| roomid        | int(11)      | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| roomname      | varchar(50)  | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| display_order | int(11)      | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| height        | varchar(100) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| dimensions    | varchar(100) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| area          | varchar(100) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| function      | varchar(100) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| floor         | varchar(50)  | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| notes         | text         | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| opentime1     | time         | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| closetime1    | time         | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| opentime2     | time         | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| closetime2    | time         | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| opentime3     | time         | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| closetime3    | time         | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
|---------------+--------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: Rooms Indexes
#+LABEL: tbl:roomsindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Rooms |          0 | PRIMARY  |            1 | roomid      | A         |          38 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

