branches/FFF/Documentation/schema.html

<div id="outline-container-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> Rooms </h2>
<div class="outline-text-2" id="text-22">


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:roomsfields" id="tbl:roomsfields"></a>
<caption>Rooms Fields</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Field</th><th scope="col">Type</th><th scope="col">Collation</th><th scope="col">Null</th><th scope="col">Key</th><th scope="col">Default</th><th scope="col">Extra</th><th scope="col">Privileges</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>roomid</td><td>int(11)</td><td>NULL</td><td></td><td>PRI</td><td>(NULL)</td><td>auto_increment</td><td>select,insert,update,references</td><td></td></tr>
<tr><td>roomname</td><td>varchar(50)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>display_order</td><td>int(11)</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>height</td><td>varchar(100)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>dimensions</td><td>varchar(100)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>area</td><td>varchar(100)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>function</td><td>varchar(100)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>floor</td><td>varchar(50)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>notes</td><td>text</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>opentime1</td><td>time</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>closetime1</td><td>time</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>opentime2</td><td>time</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>closetime2</td><td>time</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>opentime3</td><td>time</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>closetime3</td><td>time</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:roomsindexes" id="tbl:roomsindexes"></a>
<caption>Rooms Indexes</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Table</th><th scope="col">Non unique</th><th scope="col">Key name</th><th scope="col">Seq in index</th><th scope="col">Column name</th><th scope="col">Collation</th><th scope="col">Cardinality</th><th scope="col">Sub part</th><th scope="col">Packed</th><th scope="col">Null</th><th scope="col">Index type</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>Rooms</td><td>0</td><td>PRIMARY</td><td>1</td><td>roomid</td><td>A</td><td>38</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p></div>

</div>
