branches/FFF/Documentation/PDF/schema.tex
\section{Rooms}
\label{sec-22}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{Rooms Fields} \label{tbl:roomsfields}\\
\hline
 Field             &  Type          &  Collation                &  Null     &  Key      &  Default  &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 roomid            &  int(11)       &  NULL                     &  \&nbsp;  &  PRI      &  (NULL)   &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 roomname          &  varchar(50)   &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 display\_{}order  &  int(11)       &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 height            &  varchar(100)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 dimensions        &  varchar(100)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 area              &  varchar(100)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 function          &  varchar(100)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 floor             &  varchar(50)   &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 notes             &  text          &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 opentime1         &  time          &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 closetime1        &  time          &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 opentime2         &  time          &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 closetime2        &  time          &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 opentime3         &  time          &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 closetime3        &  time          &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{Rooms Indexes} \label{tbl:roomsindexes}\\
\hline
 Table  &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Rooms  &           0  &  PRIMARY   &             1  &  roomid       &  A          &           38  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}
