branches/FFF/Documentation/Source/schema.org
* RoomSets

#+CAPTION: RoomSets Fields
#+LABEL: tbl:roomsetsfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field         | Type        | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| roomsetid     | int(11)     | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| roomsetname   | varchar(50) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| display_order | int(11)     | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: RoomSets Indexes
#+LABEL: tbl:roomsetsindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table    | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| RoomSets |          0 | PRIMARY  |            1 | roomsetid   | A         |          12 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

* Schedule

#+CAPTION: Schedule Fields
#+LABEL: tbl:schedulefields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|------------+---------+-----------+--------+--------+----------+----------------+---------------------------------+---------|
| Field      | Type    | Collation | Null   | Key    |  Default | Extra          | Privileges                      | Comment |
|------------+---------+-----------+--------+--------+----------+----------------+---------------------------------+---------|
| scheduleid | int(11) | NULL      | &nbsp; | PRI    |   (NULL) | auto_increment | select,insert,update,references | &nbsp;  |
| sessionid  | int(11) | NULL      | &nbsp; | MUL    |        0 | &nbsp;         | select,insert,update,references | &nbsp;  |
| roomid     | int(11) | NULL      | &nbsp; | MUL    |        0 | &nbsp;         | select,insert,update,references | &nbsp;  |
| starttime  | time    | NULL      | &nbsp; | &nbsp; | 00:00:00 | &nbsp;         | select,insert,update,references | &nbsp;  |
|------------+---------+-----------+--------+--------+----------+----------------+---------------------------------+---------|

#+CAPTION: Schedule Indexes
#+LABEL: tbl:scheduleindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|----------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table    | Non unique | Key name  | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|----------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Schedule |          0 | PRIMARY   |            1 | scheduleid  | A         |           1 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| Schedule |          1 | sessionid |            1 | sessionid   | A         |           1 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| Schedule |          1 | roomid    |            1 | roomid      | A         |           1 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|----------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: Schedule Foreign Key Relationships
#+LABEL: tbl:schedulefkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|-----------------+-----------------+---------------+---------------+------------|
| FK Id           | Reference Table | Source Column | Target Column | Extra Info |
|-----------------+-----------------+---------------+---------------+------------|
| Schedule_ibfk_1 | Sessions        | `sessionid`   | `sessionid`   |            |
| Schedule_ibfk_2 | Rooms           | `roomid`      | `roomid`      |            |
|-----------------+-----------------+---------------+---------------+------------|

