branches/FFF/Documentation/PDF/schema.tex
\section{RoomSets}
\label{sec-23}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{RoomSets Fields} \label{tbl:roomsetsfields}\\
\hline
 Field             &  Type         &  Collation                &  Null     &  Key      &  Default  &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 roomsetid         &  int(11)      &  NULL                     &  \&nbsp;  &  PRI      &  (NULL)   &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 roomsetname       &  varchar(50)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 display\_{}order  &  int(11)      &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{RoomSets Indexes} \label{tbl:roomsetsindexes}\\
\hline
 Table     &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 RoomSets  &           0  &  PRIMARY   &             1  &  roomsetid    &  A          &           12  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}
\section{Schedule}
\label{sec-24}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{Schedule Fields} \label{tbl:schedulefields}\\
\hline
 Field       &  Type     &  Collation  &  Null     &  Key      &   Default  &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 scheduleid  &  int(11)  &  NULL       &  \&nbsp;  &  PRI      &    (NULL)  &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 sessionid   &  int(11)  &  NULL       &  \&nbsp;  &  MUL      &         0  &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 roomid      &  int(11)  &  NULL       &  \&nbsp;  &  MUL      &         0  &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 starttime   &  time     &  NULL       &  \&nbsp;  &  \&nbsp;  &  00:00:00  &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{Schedule Indexes} \label{tbl:scheduleindexes}\\
\hline
 Table     &  Non unique  &  Key name   &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Schedule  &           0  &  PRIMARY    &             1  &  scheduleid   &  A          &            1  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 Schedule  &           1  &  sessionid  &             1  &  sessionid    &  A          &            1  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 Schedule  &           1  &  roomid     &             1  &  roomid       &  A          &            1  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{Schedule Foreign Key Relationships} \label{tbl:schedulefkr}\\
\hline
 FK Id                  &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Schedule\_{}ibfk\_{}1  &  Sessions         &  `sessionid`    &  `sessionid`    &              \\
 Schedule\_{}ibfk\_{}2  &  Rooms            &  `roomid`       &  `roomid`       &              \\
\hline
\end{longtable}
