branches/FFF/Documentation/Source/schema.org
* Services

#+CAPTION: Services Fields
#+LABEL: tbl:servicesfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field         | Type        | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| serviceid     | int(11)     | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| servicename   | varchar(50) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| display_order | int(11)     | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: Service Indexes
#+LABEL: tbl:serviceindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table    | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Services |          0 | PRIMARY  |            1 | serviceid   | A         |          14 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|----------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

* SessionHasFeature

#+CAPTION: SessionHasFeature Fields
#+LABEL: tbl:sessionhasfeaturefields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|-----------+---------+-----------+--------+-----+---------+--------+---------------------------------+---------|
| Field     | Type    | Collation | Null   | Key | Default | Extra  | Privileges                      | Comment |
|-----------+---------+-----------+--------+-----+---------+--------+---------------------------------+---------|
| sessionid | int(11) | NULL      | &nbsp; | PRI |       0 | &nbsp; | select,insert,update,references | &nbsp;  |
| featureid | int(11) | NULL      | &nbsp; | PRI |       0 | &nbsp; | select,insert,update,references | &nbsp;  |
|-----------+---------+-----------+--------+-----+---------+--------+---------------------------------+---------|

#+CAPTION: SessionHasFeature Indexes
#+LABEL: tbl:sessionhasfeatureindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-------------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table             | Non unique | Key name  | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-------------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| SessionHasFeature |          0 | PRIMARY   |            1 | sessionid   | A         |           0 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| SessionHasFeature |          0 | PRIMARY   |            2 | featureid   | A         |           0 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| SessionHasFeature |          1 | featureid |            1 | featureid   | A         |           0 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-------------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: SessionHasFeature Foreign Key Relationships
#+LABEL: tbl:sessionhasfeaturefkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|--------------------------+-----------------+---------------+---------------+------------|
| FK Id                    | Reference Table | Source Column | Target Column | Extra Info |
|--------------------------+-----------------+---------------+---------------+------------|
| SessionHasFeature_ibfk_1 | Sessions        | `sessionid`   | `sessionid`   |            |
| SessionHasFeature_ibfk_2 | Features        | `featureid`   | `featureid`   |            |
|--------------------------+-----------------+---------------+---------------+------------|

