branches/FFF/Documentation/PDF/schema.tex
\section{Services}
\label{sec-25}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{Services Fields} \label{tbl:servicesfields}\\
\hline
 Field             &  Type         &  Collation                &  Null     &  Key      &  Default  &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 serviceid         &  int(11)      &  NULL                     &  \&nbsp;  &  PRI      &  (NULL)   &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 servicename       &  varchar(50)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 display\_{}order  &  int(11)      &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{Service Indexes} \label{tbl:serviceindexes}\\
\hline
 Table     &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Services  &           0  &  PRIMARY   &             1  &  serviceid    &  A          &           14  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}
\section{SessionHasFeature}
\label{sec-26}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{SessionHasFeature Fields} \label{tbl:sessionhasfeaturefields}\\
\hline
 Field      &  Type     &  Collation  &  Null     &  Key  &  Default  &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 sessionid  &  int(11)  &  NULL       &  \&nbsp;  &  PRI  &        0  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 featureid  &  int(11)  &  NULL       &  \&nbsp;  &  PRI  &        0  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{SessionHasFeature Indexes} \label{tbl:sessionhasfeatureindexes}\\
\hline
 Table              &  Non unique  &  Key name   &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 SessionHasFeature  &           0  &  PRIMARY    &             1  &  sessionid    &  A          &            0  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 SessionHasFeature  &           0  &  PRIMARY    &             2  &  featureid    &  A          &            0  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 SessionHasFeature  &           1  &  featureid  &             1  &  featureid    &  A          &            0  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{SessionHasFeature Foreign Key Relationships} \label{tbl:sessionhasfeaturefkr}\\
\hline
 FK Id                           &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 SessionHasFeature\_{}ibfk\_{}1  &  Sessions         &  `sessionid`    &  `sessionid`    &              \\
 SessionHasFeature\_{}ibfk\_{}2  &  Features         &  `featureid`    &  `featureid`    &              \\
\hline
\end{longtable}
