branches/FFF/Documentation/Source/schema.org
* SessionHasPubChar

#+CAPTION: SessionHasPubChar Fields
#+LABEL: tbl:sessionhaspubcharfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|-----------+---------+-----------+--------+-----+---------+--------+---------------------------------+---------|
| Field     | Type    | Collation | Null   | Key | Default | Extra  | Privileges                      | Comment |
|-----------+---------+-----------+--------+-----+---------+--------+---------------------------------+---------|
| sessionid | int(11) | NULL      | &nbsp; | PRI |       0 | &nbsp; | select,insert,update,references | &nbsp;  |
| pubcharid | int(11) | NULL      | &nbsp; | PRI |       0 | &nbsp; | select,insert,update,references | &nbsp;  |
|-----------+---------+-----------+--------+-----+---------+--------+---------------------------------+---------|

#+CAPTION: SessionHasPubChar Indexes
#+LABEL: tbl:sessionhaspubcharindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table             | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| SessionHasPubChar |          0 | PRIMARY  |            1 | sessionid   | A         |           0 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| SessionHasPubChar |          0 | PRIMARY  |            2 | pubcharid   | A         |           0 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| SessionHasPubChar |          1 | Fkey2    |            1 | pubcharid   | A         |           0 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-------------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: SessionHasPubChar Foreign Key Relationships
#+LABEL: tbl:sessionhaspubcharfkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|-------+--------------------+---------------+---------------+------------|
| FK Id | Reference Table    | Source Column | Target Column | Extra Info |
|-------+--------------------+---------------+---------------+------------|
| Fkey1 | Sessions           | `sessionid`   | `sessionid`   |            |
| Fkey2 | PubCharacteristics | `pubcharid`   | `pubcharid`   |            |
|-------+--------------------+---------------+---------------+------------|

