branches/FFF/Documentation/schema.html

<div id="outline-container-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> SessionHasPubChar </h2>
<div class="outline-text-2" id="text-27">


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:sessionhaspubcharfields" id="tbl:sessionhaspubcharfields"></a>
<caption>SessionHasPubChar Fields</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="right" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Field</th><th scope="col">Type</th><th scope="col">Collation</th><th scope="col">Null</th><th scope="col">Key</th><th scope="col">Default</th><th scope="col">Extra</th><th scope="col">Privileges</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>sessionid</td><td>int(11)</td><td>NULL</td><td></td><td>PRI</td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>pubcharid</td><td>int(11)</td><td>NULL</td><td></td><td>PRI</td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:sessionhaspubcharindexes" id="tbl:sessionhaspubcharindexes"></a>
<caption>SessionHasPubChar Indexes</caption>
<colgroup><col align="left" /><col align="right" /><col align="left" /><col align="right" /><col align="left" /><col align="left" /><col align="right" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Table</th><th scope="col">Non unique</th><th scope="col">Key name</th><th scope="col">Seq in index</th><th scope="col">Column name</th><th scope="col">Collation</th><th scope="col">Cardinality</th><th scope="col">Sub part</th><th scope="col">Packed</th><th scope="col">Null</th><th scope="col">Index type</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>SessionHasPubChar</td><td>0</td><td>PRIMARY</td><td>1</td><td>sessionid</td><td>A</td><td>0</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
<tr><td>SessionHasPubChar</td><td>0</td><td>PRIMARY</td><td>2</td><td>pubcharid</td><td>A</td><td>0</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
<tr><td>SessionHasPubChar</td><td>1</td><td>Fkey2</td><td>1</td><td>pubcharid</td><td>A</td><td>0</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:sessionhaspubcharfkr" id="tbl:sessionhaspubcharfkr"></a>
<caption>SessionHasPubChar Foreign Key Relationships</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">FK Id</th><th scope="col">Reference Table</th><th scope="col">Source Column</th><th scope="col">Target Column</th><th scope="col">Extra Info</th></tr>
</thead>
<tbody>
<tr><td>Fkey1</td><td>Sessions</td><td>`sessionid`</td><td>`sessionid`</td><td></td></tr>
<tr><td>Fkey2</td><td>PubCharacteristics</td><td>`pubcharid`</td><td>`pubcharid`</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p></div>

</div>
