branches/FFF/Documentation/PDF/schema.tex
\section{SessionHasPubChar}
\label{sec-27}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{SessionHasPubChar Fields} \label{tbl:sessionhaspubcharfields}\\
\hline
 Field      &  Type     &  Collation  &  Null     &  Key  &  Default  &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 sessionid  &  int(11)  &  NULL       &  \&nbsp;  &  PRI  &        0  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 pubcharid  &  int(11)  &  NULL       &  \&nbsp;  &  PRI  &        0  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{SessionHasPubChar Indexes} \label{tbl:sessionhaspubcharindexes}\\
\hline
 Table              &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 SessionHasPubChar  &           0  &  PRIMARY   &             1  &  sessionid    &  A          &            0  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 SessionHasPubChar  &           0  &  PRIMARY   &             2  &  pubcharid    &  A          &            0  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 SessionHasPubChar  &           1  &  Fkey2     &             1  &  pubcharid    &  A          &            0  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{SessionHasPubChar Foreign Key Relationships} \label{tbl:sessionhaspubcharfkr}\\
\hline
 FK Id  &  Reference Table     &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Fkey1  &  Sessions            &  `sessionid`    &  `sessionid`    &              \\
 Fkey2  &  PubCharacteristics  &  `pubcharid`    &  `pubcharid`    &              \\
\hline
\end{longtable}
