branches/FFF/Documentation/Source/schema.org
* SessionHasService

#+CAPTION: SessionHasService Fields
#+LABEL: tbl:sessionhasservicefields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|-----------+---------+-----------+--------+-----+---------+--------+---------------------------------+---------|
| Field     | Type    | Collation | Null   | Key | Default | Extra  | Privileges                      | Comment |
|-----------+---------+-----------+--------+-----+---------+--------+---------------------------------+---------|
| sessionid | int(11) | NULL      | &nbsp; | PRI |       0 | &nbsp; | select,insert,update,references | &nbsp;  |
| serviceid | int(11) | NULL      | &nbsp; | PRI |       0 | &nbsp; | select,insert,update,references | &nbsp;  |
|-----------+---------+-----------+--------+-----+---------+--------+---------------------------------+---------|

#+CAPTION: SessionHasService Indexes
#+LABEL: tbl:sessionhasserviceindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-------------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table             | Non unique | Key name  | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-------------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| SessionHasService |          0 | PRIMARY   |            1 | sessionid   | A         |           0 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| SessionHasService |          0 | PRIMARY   |            2 | serviceid   | A         |           0 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| SessionHasService |          1 | serviceid |            1 | serviceid   | A         |           0 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-------------------+------------+-----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: SessionHasService Foreign Key Relationships
#+LABEL: tbl:sessonhasservicefkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|--------------------------+-----------------+---------------+---------------+------------|
| FK Id                    | Reference Table | Source Column | Target Column | Extra Info |
|--------------------------+-----------------+---------------+---------------+------------|
| SessionHasService_ibfk_1 | Sessions        | `sessionid`   | `sessionid`   |            |
| SessionHasService_ibfk_2 | Services        | `serviceid`   | `serviceid`   |            |
|--------------------------+-----------------+---------------+---------------+------------|

