branches/FFF/Documentation/PDF/schema.tex
\section{SessionHasService}
\label{sec-28}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{SessionHasService Fields} \label{tbl:sessionhasservicefields}\\
\hline
 Field      &  Type     &  Collation  &  Null     &  Key  &  Default  &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 sessionid  &  int(11)  &  NULL       &  \&nbsp;  &  PRI  &        0  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 serviceid  &  int(11)  &  NULL       &  \&nbsp;  &  PRI  &        0  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{SessionHasService Indexes} \label{tbl:sessionhasserviceindexes}\\
\hline
 Table              &  Non unique  &  Key name   &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 SessionHasService  &           0  &  PRIMARY    &             1  &  sessionid    &  A          &            0  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 SessionHasService  &           0  &  PRIMARY    &             2  &  serviceid    &  A          &            0  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 SessionHasService  &           1  &  serviceid  &             1  &  serviceid    &  A          &            0  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{SessionHasService Foreign Key Relationships} \label{tbl:sessonhasservicefkr}\\
\hline
 FK Id                           &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 SessionHasService\_{}ibfk\_{}1  &  Sessions         &  `sessionid`    &  `sessionid`    &              \\
 SessionHasService\_{}ibfk\_{}2  &  Services         &  `serviceid`    &  `serviceid`    &              \\
\hline
\end{longtable}
