branches/FFF/Documentation/Source/schema.org
* Sessions

#+CAPTION: Sessions Fields
#+LABEL: tbl:sessionsfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|----------------+--------------+-------------------+--------+--------+-------------------+----------------+---------------------------------+---------|
| Field          | Type         | Collation         | Null   | Key    | Default           | Extra          | Privileges                      | Comment |
|----------------+--------------+-------------------+--------+--------+-------------------+----------------+---------------------------------+---------|
| sessionid      | int(11)      | NULL              | &nbsp; | PRI    | (NULL)            | auto_increment | select,insert,update,references | &nbsp;  |
| trackid        | int(11)      | NULL              | &nbsp; | MUL    | 0                 | &nbsp;         | select,insert,update,references | &nbsp;  |
| typeid         | int(11)      | NULL              | &nbsp; | MUL    | 0                 | &nbsp;         | select,insert,update,references | &nbsp;  |
| divisionid     | int(11)      | NULL              | &nbsp; | MUL    | 0                 | &nbsp;         | select,insert,update,references | &nbsp;  |
| pubstatusid    | int(11)      | NULL              | YES    | MUL    | 0                 | &nbsp;         | select,insert,update,references | &nbsp;  |
| pubsno         | varchar(50)  | latin1_swedish_ci | YES    | &nbsp; | (NULL)            | &nbsp;         | select,insert,update,references | &nbsp;  |
| title          | varchar(100) | latin1_swedish_ci | YES    | &nbsp; | (NULL)            | &nbsp;         | select,insert,update,references | &nbsp;  |
| pocketprogtext | text         | latin1_swedish_ci | YES    | &nbsp; | (NULL)            | &nbsp;         | select,insert,update,references | &nbsp;  |
| progguiddesc   | text         | latin1_general_ci | YES    | &nbsp; | (NULL)            | &nbsp;         | select,insert,update,references | &nbsp;  |
| persppartinfo  | text         | latin1_swedish_ci | YES    | &nbsp; | (NULL)            | &nbsp;         | select,insert,update,references | &nbsp;  |
| duration       | time         | NULL              | YES    | &nbsp; | (NULL)            | &nbsp;         | select,insert,update,references | &nbsp;  |
| estatten       | int(11)      | NULL              | YES    | &nbsp; | (NULL)            | &nbsp;         | select,insert,update,references | &nbsp;  |
| kidscatid      | int(11)      | NULL              | &nbsp; | MUL    | 0                 | &nbsp;         | select,insert,update,references | &nbsp;  |
| signupreq      | tinyint(1)   | NULL              | YES    | &nbsp; | (NULL)            | &nbsp;         | select,insert,update,references | &nbsp;  |
| roomsetid      | int(11)      | NULL              | &nbsp; | MUL    | 0                 | &nbsp;         | select,insert,update,references | &nbsp;  |
| notesforpart   | text         | latin1_swedish_ci | YES    | &nbsp; | (NULL)            | &nbsp;         | select,insert,update,references | &nbsp;  |
| servicenotes   | text         | latin1_swedish_ci | YES    | &nbsp; | (NULL)            | &nbsp;         | select,insert,update,references | &nbsp;  |
| statusid       | int(11)      | NULL              | &nbsp; | MUL    | 0                 | &nbsp;         | select,insert,update,references | &nbsp;  |
| notesforprog   | text         | latin1_swedish_ci | YES    | &nbsp; | (NULL)            | &nbsp;         | select,insert,update,references | &nbsp;  |
| warnings       | tinyint(1)   | NULL              | YES    | &nbsp; | (NULL)            | &nbsp;         | select,insert,update,references | &nbsp;  |
| invitedguest   | tinyint(1)   | NULL              | YES    | &nbsp; | 0                 | &nbsp;         | select,insert,update,references | &nbsp;  |
| ts             | timestamp    | NULL              | YES    | &nbsp; | CURRENT_TIMESTAMP | &nbsp;         | select,insert,update,references | &nbsp;  |
|----------------+--------------+-------------------+--------+--------+-------------------+----------------+---------------------------------+---------|

#+CAPTION: Sessions Indexes
#+LABEL: tbl:sessionsindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|----------+------------+-----------------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table    | Non unique | Key name        | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|----------+------------+-----------------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Sessions |          0 | PRIMARY         |            1 | sessionid   | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| Sessions |          1 | trackid         |            1 | trackid     | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| Sessions |          1 | typeid          |            1 | typeid      | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| Sessions |          1 | kidscatid       |            1 | kidscatid   | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| Sessions |          1 | roomsetid       |            1 | roomsetid   | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| Sessions |          1 | statusid        |            1 | statusid    | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| Sessions |          1 | Sessions_ibfk_6 |            1 | pubstatusid | A         |           2 | (NULL)   | (NULL) | YES    | BTREE      | &nbsp;  |
| Sessions |          1 | Sessions_ibfk_7 |            1 | divisionid  | A         |           2 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|----------+------------+-----------------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: Sessions Foreign Key Relationships
#+LABEL: tbl:sessionsfkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|-----------------+-----------------+---------------+---------------+------------|
| FK Id           | Reference Table | Source Column | Target Column | Extra Info |
|-----------------+-----------------+---------------+---------------+------------|
| Sessions_ibfk_7 | Divisions       | `divisionid`  | `divisionid`  |            |
| Sessions_ibfk_1 | Tracks          | `trackid`     | `trackid`     |            |
| Sessions_ibfk_2 | Types           | `typeid`      | `typeid`      |            |
| Sessions_ibfk_3 | KidsCategories  | `kidscatid`   | `kidscatid`   |            |
| Sessions_ibfk_4 | RoomSets        | `roomsetid`   | `roomsetid`   |            |
| Sessions_ibfk_5 | SessionStatuses | `statusid`    | `statusid`    |            |
| Sessions_ibfk_6 | PubStatuses     | `pubstatusid` | `pubstatusid` |            |
|-----------------+-----------------+---------------+---------------+------------|

