branches/FFF/Documentation/schema.html

<div id="outline-container-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> Sessions </h2>
<div class="outline-text-2" id="text-29">


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:sessionsfields" id="tbl:sessionsfields"></a>
<caption>Sessions Fields</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Field</th><th scope="col">Type</th><th scope="col">Collation</th><th scope="col">Null</th><th scope="col">Key</th><th scope="col">Default</th><th scope="col">Extra</th><th scope="col">Privileges</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>sessionid</td><td>int(11)</td><td>NULL</td><td></td><td>PRI</td><td>(NULL)</td><td>auto_increment</td><td>select,insert,update,references</td><td></td></tr>
<tr><td>trackid</td><td>int(11)</td><td>NULL</td><td></td><td>MUL</td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>typeid</td><td>int(11)</td><td>NULL</td><td></td><td>MUL</td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>divisionid</td><td>int(11)</td><td>NULL</td><td></td><td>MUL</td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>pubstatusid</td><td>int(11)</td><td>NULL</td><td>YES</td><td>MUL</td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>pubsno</td><td>varchar(50)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>title</td><td>varchar(100)</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>pocketprogtext</td><td>text</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>progguiddesc</td><td>text</td><td>latin1_general_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>persppartinfo</td><td>text</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>duration</td><td>time</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>estatten</td><td>int(11)</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>kidscatid</td><td>int(11)</td><td>NULL</td><td></td><td>MUL</td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>signupreq</td><td>tinyint(1)</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>roomsetid</td><td>int(11)</td><td>NULL</td><td></td><td>MUL</td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>notesforpart</td><td>text</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>servicenotes</td><td>text</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>statusid</td><td>int(11)</td><td>NULL</td><td></td><td>MUL</td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>notesforprog</td><td>text</td><td>latin1_swedish_ci</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>warnings</td><td>tinyint(1)</td><td>NULL</td><td>YES</td><td></td><td>(NULL)</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>invitedguest</td><td>tinyint(1)</td><td>NULL</td><td>YES</td><td></td><td>0</td><td></td><td>select,insert,update,references</td><td></td></tr>
<tr><td>ts</td><td>timestamp</td><td>NULL</td><td>YES</td><td></td><td>CURRENT_TIMESTAMP</td><td></td><td>select,insert,update,references</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:sessionsindexes" id="tbl:sessionsindexes"></a>
<caption>Sessions Indexes</caption>
<colgroup><col align="left" /><col align="right" /><col align="left" /><col align="right" /><col align="left" /><col align="left" /><col align="right" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Table</th><th scope="col">Non unique</th><th scope="col">Key name</th><th scope="col">Seq in index</th><th scope="col">Column name</th><th scope="col">Collation</th><th scope="col">Cardinality</th><th scope="col">Sub part</th><th scope="col">Packed</th><th scope="col">Null</th><th scope="col">Index type</th><th scope="col">Comment</th></tr>
</thead>
<tbody>
<tr><td>Sessions</td><td>0</td><td>PRIMARY</td><td>1</td><td>sessionid</td><td>A</td><td>2</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
<tr><td>Sessions</td><td>1</td><td>trackid</td><td>1</td><td>trackid</td><td>A</td><td>2</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
<tr><td>Sessions</td><td>1</td><td>typeid</td><td>1</td><td>typeid</td><td>A</td><td>2</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
<tr><td>Sessions</td><td>1</td><td>kidscatid</td><td>1</td><td>kidscatid</td><td>A</td><td>2</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
<tr><td>Sessions</td><td>1</td><td>roomsetid</td><td>1</td><td>roomsetid</td><td>A</td><td>2</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
<tr><td>Sessions</td><td>1</td><td>statusid</td><td>1</td><td>statusid</td><td>A</td><td>2</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
<tr><td>Sessions</td><td>1</td><td>Sessions_ibfk_6</td><td>1</td><td>pubstatusid</td><td>A</td><td>2</td><td>(NULL)</td><td>(NULL)</td><td>YES</td><td>BTREE</td><td></td></tr>
<tr><td>Sessions</td><td>1</td><td>Sessions_ibfk_7</td><td>1</td><td>divisionid</td><td>A</td><td>2</td><td>(NULL)</td><td>(NULL)</td><td></td><td>BTREE</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p><TABLE border="1" rules="all" frame="border">
<a name="tbl:sessionsfkr" id="tbl:sessionsfkr"></a>
<caption>Sessions Foreign Key Relationships</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">FK Id</th><th scope="col">Reference Table</th><th scope="col">Source Column</th><th scope="col">Target Column</th><th scope="col">Extra Info</th></tr>
</thead>
<tbody>
<tr><td>Sessions_ibfk_7</td><td>Divisions</td><td>`divisionid`</td><td>`divisionid`</td><td></td></tr>
<tr><td>Sessions_ibfk_1</td><td>Tracks</td><td>`trackid`</td><td>`trackid`</td><td></td></tr>
<tr><td>Sessions_ibfk_2</td><td>Types</td><td>`typeid`</td><td>`typeid`</td><td></td></tr>
<tr><td>Sessions_ibfk_3</td><td>KidsCategories</td><td>`kidscatid`</td><td>`kidscatid`</td><td></td></tr>
<tr><td>Sessions_ibfk_4</td><td>RoomSets</td><td>`roomsetid`</td><td>`roomsetid`</td><td></td></tr>
<tr><td>Sessions_ibfk_5</td><td>SessionStatuses</td><td>`statusid`</td><td>`statusid`</td><td></td></tr>
<tr><td>Sessions_ibfk_6</td><td>PubStatuses</td><td>`pubstatusid`</td><td>`pubstatusid`</td><td></td></tr>
</tbody>
</table>


<p><br/>
</p></div>

</div>
