branches/FFF/Documentation/PDF/schema.tex
\section{Sessions}
\label{sec-29}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{Sessions Fields} \label{tbl:sessionsfields}\\
\hline
 Field           &  Type          &  Collation                &  Null     &  Key      &  Default               &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 sessionid       &  int(11)       &  NULL                     &  \&nbsp;  &  PRI      &  (NULL)                &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 trackid         &  int(11)       &  NULL                     &  \&nbsp;  &  MUL      &  0                     &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 typeid          &  int(11)       &  NULL                     &  \&nbsp;  &  MUL      &  0                     &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 divisionid      &  int(11)       &  NULL                     &  \&nbsp;  &  MUL      &  0                     &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 pubstatusid     &  int(11)       &  NULL                     &  YES      &  MUL      &  0                     &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 pubsno          &  varchar(50)   &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)                &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 title           &  varchar(100)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)                &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 pocketprogtext  &  text          &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)                &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 progguiddesc    &  text          &  latin1\_{}general\_{}ci  &  YES      &  \&nbsp;  &  (NULL)                &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 persppartinfo   &  text          &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)                &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 duration        &  time          &  NULL                     &  YES      &  \&nbsp;  &  (NULL)                &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 estatten        &  int(11)       &  NULL                     &  YES      &  \&nbsp;  &  (NULL)                &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 kidscatid       &  int(11)       &  NULL                     &  \&nbsp;  &  MUL      &  0                     &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 signupreq       &  tinyint(1)    &  NULL                     &  YES      &  \&nbsp;  &  (NULL)                &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 roomsetid       &  int(11)       &  NULL                     &  \&nbsp;  &  MUL      &  0                     &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 notesforpart    &  text          &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)                &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 servicenotes    &  text          &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)                &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 statusid        &  int(11)       &  NULL                     &  \&nbsp;  &  MUL      &  0                     &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 notesforprog    &  text          &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)                &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 warnings        &  tinyint(1)    &  NULL                     &  YES      &  \&nbsp;  &  (NULL)                &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 invitedguest    &  tinyint(1)    &  NULL                     &  YES      &  \&nbsp;  &  0                     &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 ts              &  timestamp     &  NULL                     &  YES      &  \&nbsp;  &  CURRENT\_{}TIMESTAMP  &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{Sessions Indexes} \label{tbl:sessionsindexes}\\
\hline
 Table     &  Non unique  &  Key name               &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Sessions  &           0  &  PRIMARY                &             1  &  sessionid    &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 Sessions  &           1  &  trackid                &             1  &  trackid      &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 Sessions  &           1  &  typeid                 &             1  &  typeid       &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 Sessions  &           1  &  kidscatid              &             1  &  kidscatid    &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 Sessions  &           1  &  roomsetid              &             1  &  roomsetid    &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 Sessions  &           1  &  statusid               &             1  &  statusid     &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 Sessions  &           1  &  Sessions\_{}ibfk\_{}6  &             1  &  pubstatusid  &  A          &            2  &  (NULL)    &  (NULL)  &  YES      &  BTREE       &  \&nbsp;  \\
 Sessions  &           1  &  Sessions\_{}ibfk\_{}7  &             1  &  divisionid   &  A          &            2  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{Sessions Foreign Key Relationships} \label{tbl:sessionsfkr}\\
\hline
 FK Id                  &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Sessions\_{}ibfk\_{}7  &  Divisions        &  `divisionid`   &  `divisionid`   &              \\
 Sessions\_{}ibfk\_{}1  &  Tracks           &  `trackid`      &  `trackid`      &              \\
 Sessions\_{}ibfk\_{}2  &  Types            &  `typeid`       &  `typeid`       &              \\
 Sessions\_{}ibfk\_{}3  &  KidsCategories   &  `kidscatid`    &  `kidscatid`    &              \\
 Sessions\_{}ibfk\_{}4  &  RoomSets         &  `roomsetid`    &  `roomsetid`    &              \\
 Sessions\_{}ibfk\_{}5  &  SessionStatuses  &  `statusid`     &  `statusid`     &              \\
 Sessions\_{}ibfk\_{}6  &  PubStatuses      &  `pubstatusid`  &  `pubstatusid`  &              \\
\hline
\end{longtable}
