branches/FFF/Documentation/Source/schema.org
* SessionStatuses

#+CAPTION: SessionStatuses Fields
#+LABEL: tbl:sessionstatusesfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field         | Type        | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| statusid      | int(11)     | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| statusname    | varchar(50) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| display_order | int(11)     | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: SessionStatuses Indexes
#+LABEL: tbl:sessionstatusesindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-----------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table           | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-----------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| SessionStatuses |          0 | PRIMARY  |            1 | statusid    | A         |           7 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-----------------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

* Times

#+CAPTION: Times Fields
#+LABEL: tbl:timessfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+----------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| Field         | Type     | Collation         | Null   | Key    | Default | Extra  | Privileges                      | Comment |
|---------------+----------+-------------------+--------+--------+---------+--------+---------------------------------+---------|
| timeindex     | int(11)  | NULL              | &nbsp; | PRI    | 0       | &nbsp; | select,insert,update,references | &nbsp;  |
| timetext      | char(10) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
| display_order | int(11)  | NULL              | YES    | &nbsp; | (NULL)  | &nbsp; | select,insert,update,references | &nbsp;  |
|---------------+----------+-------------------+--------+--------+---------+--------+---------------------------------+---------|

#+CAPTION: Times Indexes
#+LABEL: tbl:timesindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Times |          0 | PRIMARY  |            1 | timeindex   | A         |          24 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

