branches/FFF/Documentation/PDF/schema.tex
\section{SessionStatuses}
\label{sec-30}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{SessionStatuses Fields} \label{tbl:sessionstatusesfields}\\
\hline
 Field             &  Type         &  Collation                &  Null     &  Key      &  Default  &  Extra              &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 statusid          &  int(11)      &  NULL                     &  \&nbsp;  &  PRI      &  (NULL)   &  auto\_{}increment  &  select,insert,update,references  &  \&nbsp;  \\
 statusname        &  varchar(50)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
 display\_{}order  &  int(11)      &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;            &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{SessionStatuses Indexes} \label{tbl:sessionstatusesindexes}\\
\hline
 Table            &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 SessionStatuses  &           0  &  PRIMARY   &             1  &  statusid     &  A          &            7  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}
\section{Times}
\label{sec-31}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{Times Fields} \label{tbl:timessfields}\\
\hline
 Field             &  Type      &  Collation                &  Null     &  Key      &  Default  &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 timeindex         &  int(11)   &  NULL                     &  \&nbsp;  &  PRI      &  0        &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 timetext          &  char(10)  &  latin1\_{}swedish\_{}ci  &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 display\_{}order  &  int(11)   &  NULL                     &  YES      &  \&nbsp;  &  (NULL)   &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{Times Indexes} \label{tbl:timesindexes}\\
\hline
 Table  &  Non unique  &  Key name  &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 Times  &           0  &  PRIMARY   &             1  &  timeindex    &  A          &           24  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}
