branches/FFF/Documentation/Source/schema.org
* Tracks

#+CAPTION: Tracks Fields
#+LABEL: tbl:tracksfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field         | Type        | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| trackid       | int(11)     | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| trackname     | varchar(50) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| display_order | int(11)     | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| selfselect    | tinyint(1)  | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: Tracks Indexes
#+LABEL: tbl:trackssindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|--------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table  | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|--------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Tracks |          0 | PRIMARY  |            1 | trackid     | A         |          22 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|--------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

* Types

#+CAPTION: Types Fields
#+LABEL: tbl:typesfields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| Field         | Type        | Collation         | Null   | Key    | Default | Extra          | Privileges                      | Comment |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|
| typeid        | int(11)     | NULL              | &nbsp; | PRI    | (NULL)  | auto_increment | select,insert,update,references | &nbsp;  |
| typename      | varchar(50) | latin1_swedish_ci | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
| display_order | int(11)     | NULL              | YES    | &nbsp; | (NULL)  | &nbsp;         | select,insert,update,references | &nbsp;  |
|---------------+-------------+-------------------+--------+--------+---------+----------------+---------------------------------+---------|

#+CAPTION: Types Indexes
#+LABEL: tbl:typesindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table | Non unique | Key name | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Types |          0 | PRIMARY  |            1 | typeid      | A         |          16 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-------+------------+----------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

