branches/FFF/Documentation/Source/schema.org
* UserHasPermissionRole

#+CAPTION: UserHasPermissionRole Fields
#+LABEL: tbl:userhaspermissionrolefields
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|
|------------+-------------+-------------------+--------+-----+---------+--------+---------------------------------+---------|
| Field      | Type        | Collation         | Null   | Key | Default | Extra  | Privileges                      | Comment |
|------------+-------------+-------------------+--------+-----+---------+--------+---------------------------------+---------|
| badgeid    | varchar(15) | latin1_swedish_ci | &nbsp; | PRI | &nbsp;  | &nbsp; | select,insert,update,references | &nbsp;  |
| permroleid | int(11)     | NULL              | &nbsp; | PRI | 0       | &nbsp; | select,insert,update,references | &nbsp;  |
|------------+-------------+-------------------+--------+-----+---------+--------+---------------------------------+---------|

#+CAPTION: UserHasPermissionRole Indexes
#+LABEL: tbl:userhaspermissionroleindexes
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|l|l|l|l|l|l|l|
|-----------------------+------------+--------------------------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| Table                 | Non unique | Key name                 | Seq in index | Column name | Collation | Cardinality | Sub part | Packed | Null   | Index type | Comment |
|-----------------------+------------+--------------------------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|
| UserHasPermissionRole |          0 | PRIMARY                  |            1 | badgeid     | A         |           0 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| UserHasPermissionRole |          0 | PRIMARY                  |            2 | permroleid  | A         |           0 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
| UserHasPermissionRole |          1 | FK_UserHasPermissionRole |            1 | permroleid  | A         |           0 | (NULL)   | (NULL) | &nbsp; | BTREE      | &nbsp;  |
|-----------------------+------------+--------------------------+--------------+-------------+-----------+-------------+----------+--------+--------+------------+---------|

#+CAPTION: UserHasPermissionRole Foreign Key Relationships
#+LABEL: tbl:UserHasPermissionrolefkr
#+ATTR_LaTeX: longtable align=|l|l|l|l|l|
|------------------------------+-----------------+---------------+---------------+------------|
| FK Id                        | Reference Table | Source Column | Target Column | Extra Info |
|------------------------------+-----------------+---------------+---------------+------------|
| UserHasPermissionRole_ibfk_2 | PermissionRoles | `permroleid`  | `permroleid`  |            |
| UserHasPermissionRole_ibfk_1 | Participants    | `badgeid`     | `badgeid`     |            |
|------------------------------+-----------------+---------------+---------------+------------|
