branches/FFF/Documentation/PDF/schema.tex
\section{UserHasPermissionRole}
\label{sec-34}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|}
\caption{UserHasPermissionRole Fields} \label{tbl:userhaspermissionrolefields}\\
\hline
 Field       &  Type         &  Collation                &  Null     &  Key  &  Default  &  Extra    &  Privileges                       &  Comment \\
\hline
\endhead
\hline\multicolumn{9}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 badgeid     &  varchar(15)  &  latin1\_{}swedish\_{}ci  &  \&nbsp;  &  PRI  &  \&nbsp;  &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
 permroleid  &  int(11)      &  NULL                     &  \&nbsp;  &  PRI  &  0        &  \&nbsp;  &  select,insert,update,references  &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|l|l|l|l|l|l|l|}
\caption{UserHasPermissionRole Indexes} \label{tbl:userhaspermissionroleindexes}\\
\hline
 Table                  &  Non unique  &  Key name                     &  Seq in index  &  Column name  &  Collation  &  Cardinality  &  Sub part  &  Packed  &  Null     &  Index type  &  Comment \\
\hline
\endhead
\hline\multicolumn{12}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 UserHasPermissionRole  &           0  &  PRIMARY                      &             1  &  badgeid      &  A          &            0  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 UserHasPermissionRole  &           0  &  PRIMARY                      &             2  &  permroleid   &  A          &            0  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
 UserHasPermissionRole  &           1  &  FK\_{}UserHasPermissionRole  &             1  &  permroleid   &  A          &            0  &  (NULL)    &  (NULL)  &  \&nbsp;  &  BTREE       &  \&nbsp;  \\
\hline
\end{longtable}


\begin{longtable}{|l|l|l|l|l|}
\caption{UserHasPermissionRole Foreign Key Relationships} \label{tbl:UserHasPermissionrolefkr}\\
\hline
 FK Id                               &  Reference Table  &  Source Column  &  Target Column  &  Extra Info \\
\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page}\
\endfoot
\endlastfoot
\hline
 UserHasPermissionRole\_{}ibfk\_{}2  &  PermissionRoles  &  `permroleid`   &  `permroleid`   &              \\
 UserHasPermissionRole\_{}ibfk\_{}1  &  Participants     &  `badgeid`      &  `badgeid`      &              \\
\hline
\end{longtable}

\end{document}
